{
    "season": 3,
    "episodes": [{
            "number": 1,
            "title": "The Cloud",
            "description": "A storm is brewing over Knighton. Monstrox has taken the form of a cloud, and is raising an army of lightning infused Stone Monsters. His first target is the new Lavalands Amusement Park. Harmony reigns in Knighton as the Knights pursue their civilian lives: Lance has a TV talk show; Axl is the singing chef on the show; Jestro is the weatherman; Clay is teaching at the Knights’ Academy; Macy, Ava and Merlok 2.0 travel the land in the Fortrex making sure the kingdom’s defenses are ready (part of a plan she and Clay have); Aaron and his hover shield is travelling the land setting extreme records. Robin is at his workshop at the Knights’ Academy doing an “independent study” – he’s working on some top secret project for Merlok 2.0. It all seems excellent! We even see the Knights new vehicles – which have been optimized for civilian life (except for Clay’s.) But storm clouds are brewing. Well, one storm cloud is brewing: the Cloud of Monstrox! Yes, the Book of Monsters has reconstituted himself and is now a cloud who needs a man on the ground to enact his new evil plan. He follows his old buddy Jestro as he goes across the realm on the weekends apologizing for being evil. ZAP! With one bolt of his evil magic lighting, the Cloud of Monstrox turns Jestro evil again (only this time a bit, well, too evil.) The evil duo are back together – and bring stone to life for the first time in the form of Gargoyles from the town of GHOULIA. Now they must gather the Forbidden Powers so that the Cloud of Monstrox can destroy the entire kingdom! A battle breaks out in the Lava Lands, where Lance and Alice Squires are reporting from the opening of the Cuthbert Richmond funded Lava Lands Amusement Park, rebuilt from the remains of Jestro’s old HQ. Jestro and the Cloud are after something in the remains and as Merlok 2.0 sends out a call for the Knights to help Lance. Can Lance (with an assist from King Halbert in his Mech) hold-off Jestro, the Cloud and their new ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/90/0e/5533f64e1ab470f9f3e0f2e41fb4d948.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/8e/61/10369502/s10369502.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/c3/2c/935c9c501618546254965e81cc267c26.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "A Little Rusty",
            "description": "The Cloud of Monstrox and Jestro unlocks a mysterious Forbidden Power. What kind ofhavoc will they unleash? And can Merlok 2.0 and the NEXO KNIGHTS make the new COMBO NEXO Powers  work? The Knights finally make it to the Lava Lands – using their various new forms of transport, which are all strictly civilian vechicles – and they must regroup and learn to fight together again to face the new threat of Jestro, the Cloud of Monstrox, and their STONE MONSTERS (in this case, Stone Gargoyles.) But Jestro and his monsters beat back the knights and recover the STAFF OF MONSTROX – which was buried under the ceremonial chamber from Episode 210 (and is now the Lava Puker amusement park ride) – and they get away on Jestro’s EVIL MOBILE, which he recovers from the HQ garage. Macy says this is exactly why she’s been touring the kingdom preparing everyone for the next attack. The Knights have to get it together because now the entire kingdom is under threat…again. Robin decides he must upgrade the Knights’ vehicles and make them more “fight optimized.” Ava and Merlok 2.0 must figure out how to use new NEXO Powers because regular NEXO Powers do make Stone monsters back into stone, but the Cloud simply zaps them to life again. Meanwhile, in the IRON MOUNTAINS, Jestro and the Cloud of Monstrox find the first of the Forbidden Powers: RELENTLESS RUST. They find the ROGUL STATUE holding the power and zap him to life. Now…they can rust those shiny knights to pieces! Ava and Merlok are attempting to use NEXO COMBO POWERS – with hilarious results – as they try to figure out how they might work. When Jestro attacks, he’s able to halt the Fortrex by instantly rusting its tracks and wheels! Robin has his hands full trying to clean all the rust from the attack of Relentless Rust. As the Knights attempt to defend against Jestro, the Cloud is zapping statues to life. He hits a statue with a bolt of lightning as Clay is touching it. Something happens…Clay feels odd; ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/be/63/540c6a176ab2c884a73ece7424799c04.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/0d/9a/10369503/s10369503.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/bc/09/3824a44b5f2d48a9ffa45c888a03065c.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "Mount Thunderstrox",
            "description": "Jestro and the Cloud of Monstrox encounters the sculptor. He helps unleash a horde of fierce garden gnomes on Knighton. What will the NEXO KNIGHTS do against this new enemy? Will their new COMBO NEXO Powers do the trick? As Jestro and the Cloud of Monstrox head off on the Evil Mobile to 'store' the Forbidden Power in a secret location, they encounter…THE SCULPTOR. His real name is ROBERTO ARNOLDI. He's a sensitive and odd artist who has been laid off by the king (the King ordered a \"smashing\" statue of the Queen, and the Sculptor made a statue of the Queen literally smashing monsters. He takes everything very literally.) Jestro instructs him to make a \"bad\" statue that he can use to attack the knights. The Sculptor sets to work. Meanwhile, the NEXO KNIGHTS are discussing the COMBO NEXO Powers, the Forbidden Powers, and what all this means. Lance, meanwhile, decides that since his talk show career is on hold, he thinks he'll install cameras in the Fortrex and do a Big Brother-like expose show on the Knights (he decides NOT to tell the others.) Merlok 2.0 and the Cloud of Monstrox (each talking to their cohorts) explain the history of the Forbidden Powers: it’s a history lesson about the WIZARDS' COUNCIL, the Forbidden Powers, and how they were stopped long ago. This visual montage leads Jestro to…MOUNT THUNDERSTROX. The Cloud of Monstrox shows him the circle of ten Standing Stones where he will insert the Forbidden Powers. \"What'll happen after that?” asks Jestro, curious. \"Oh, I don't want to spoil the surprise,\" says the Cloud. They insert the first Forbidden Power, Relentless Rust, and it locks into place on its stone. They go off to battle the Knights and collect the \"bad\" statue the sculptor is making. But he's made a literally bad statue…it’s terrible ... garden gnomes. Like an amateur art student. And…it's not even finished. (\"You can’t rush bad genius!\") The Knights attack with their newly modified vehicles and they succeed in destroying the ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/7e/19/7ef055ae215a104f124ed01a0729deab.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/7c/fd/10369504/s10369504.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/65/2d/3bcfa8ba6976995199b6d985d1af4489.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "Rotten Luck",
            "description": "Jestro and the Cloud of Monstrox unleashes the Forbidden Power Ravaging Rot on Knighton! Turning everything into green gooey rot. But Robin has an awesome new invention that could help the NEXO KNIGHTS Jestro and the Cloud of Monstrox find a second Forbidden Power near the falling down Swamp Castle: RAVAGING ROT. With this power, they can make everything in the kingdom rot – food, vegetation, anything that grows or is natural. And that’s exactly what they do! It’s awful and makes everything stink. The Sculptor start to sculpt a portable HeadQuarter for his master, Jestro. Jestro expects it to be done when they return from ravaging the land. Axl is very concerned – he’s into organic food ... and now food starts to rot. Merlok 2.0 and Ava are continuing to work on perfecting the COMBO NEXO Powers. We see display screens of MANY of the NEXO Powers. But there’s a huge power consumption issue with these new-fangled combos. “I’ll have to find an algorithmic power curve consumption solution, magic man,” says Ava. “I always just sort of choose them by, uh, feel.” “What do you feel like?” “Uh, a ham sandwich, a banana, and dragon fire,” responds Merlok. “That produced a combo with 2% efficiency,” says Ava. “This is why we have to actually THINK about and study perfec Combos. We need automatic power integration.” The Knights must stop Jestro from rotting all the food and living plant matter in Knighton and Axl leads the charge. But as they finally confront Jestro, who’s trying to rot a field of beans near Fruitbridge, they’re hit by his finally completed ROLLING HQ (the Sculptor is proud of the “artsy” elements.) … it’s not exactly perfect though … he took the idea of Head Quarter a little too litteral and created a big head. Finally, in this conclusive battle where the knights get strapped on a rotting bridge, Clay emerges in a sleek, new BATTLE SUIT that Robin built for him because he was starting to have trouble moving ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/c0/17/22236e3532834a3a8de9f7b3fc4dc820.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/d9/c4/10369505/s10369505.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/5e/8a/c896f2f416ebda2a92635d35691809e6.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Storm Over Rock Wood",
            "description": "The NEXO KNIGHTS have their powerful shields stolen by Robot Hoodlum and his Merry Mechs. And something is coming to life in the Petrified forest, and it doesn't like knights. Can the NEXO KNIGHTS deal with this without their shields? In the petrified forest of ROCKWOOD, strange things are happening. Rich folk who travel through the wood (we see JORAH TIGHTWADs TIGHTY KNIGHTIES) get robbed. It turns out to be ROBOT HOODLUM, a squirebot who leads his band of MERRY MECHS, and whose mantra is 'Steal from the rich to keep their forgotten and disused squirebots in working order. But when Jestro invades the woods and uses the Cloud of Monstrox to bring the petrified trees to life (it turns out the trees are actually petrified monsters, the result of an old battle with Merlok) they clonk Robot Hoodlum on the head and his new mantra becomes Shields from the rich. He then breaks into the Fortrex and steals the Knights special shields! They're forced to follow him into the now living petrified forest to track down their shields. A metal scrapyard in the woods turns out to be his HQ and he uses the petrified trees for all sorts of funny things (hat stands, clothing racks, etc.) But with the Knights in the woods hunting their stolen shields, the Cloud rains down lightning on the entire forest bringing the petrified monsters back to life. They attack! Robot Hoodlum helps, but he's his own guy. And he won't give them back their shields! (This whole time Aaron is freaked-out by the idea of wood turning to stone. Trippy! Is it wood? Is it a rock? Is it wood-rock?) Clay helps hold off Jestro and the petrified monsters in his BATTLE SUIT but he's battered and bruised? As the knights try to get organized, Ava downloads to Clay a great BATTLE-SUIT-COMBO NEXO Power (which her new program put together.) It turns out that his BATTLE SUIT is powerful enough to download three powers. Clay uses the COMBO NEXO Power to beat the living forest and Jestro. At the very end of the episode, Robin ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/94/75/045c410233762f52f529719a6829a4b9.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/64/d2/10369506/s10369506.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/be/a7/1c8b55acb0a09161c7cd4515bc837986.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "Miner Setback",
            "description": "Villagers are being enslaved to dig out three ancient warriors whom the Cloud of Monstrox wants to bring back to life. Can the NEXO KNIGHTS make their COMBO NEXO Powers work inside a mountain? Axl gets a disturbing message from friends in the Hill Country where his parents live…people are going missing! Axl decides the Knights must investigate and Merlok 2.0 concurs. “Strange things are happening in them hills.” It turns out that Jestro and the Cloud of Monstrox are in the hills digging up the THREE BROTHERS STATUES. They were buried there by the Wizards’ Council as it was the site of an old battle, but the Cloud of Monstrox wants to bring them back to life. They figure the big statues will give them an edge in battling the NEXO KNIGHTS once brought to life. The Sculptor, and the enslaved villagers of the Hill Country, must chisel the Three Brothers out of the stones (like dinosaur bones.) The Three Brothers come in three sizes: regular, mini and BIG. But the biggest brother’s body gets ruined when Roberto Arnoldi tries to chisel him out of the rock. Jestro is mad. “We need to get him rolling again!” says Jestro, knowing the NEXO KNIGHTS are on their way. The Sculptor takes him literally and creates THE RAMMING VEHICLE, using the Biggest Brother’s head as the battering ram. The three brothers bicker like crazy (think Three Stooges), but with their vehicle they’re dangerous. The Knights use their new Battle Suits to get into the mountain and fight Jestro’s newest monster team. They can’t get COMBO NEXO Powers inside the mountain, but the Cloud also can’t penetrate the mountain to re-zap any monsters. The Knights use a regular download power and then they can freeze the monsters in the mountain. Desperate, the Cloud decided to try to penetrate the mountain to help Jestro. But as he goes, his misty essence is absorbed by the rock. He turns out being the size of a small steam cloud and he talks like a hamster (too much of him was absorbed by the ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/d6/8e/8d5fd348adf0caecd35ff122b8b4e857.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/88/8c/10369507/s10369507.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/ce/be/ee2e2541d381debfd2c84792520b932e.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "Knight at the Museum",
            "description": "At K.O.M.A. (Knightonia Official Museum of Art) Monstrox learns that a Forbidden Power tablet is hidden. And he will do anything to get it. Especially if King Halbert is happens to visit at the same time. The NEXO KNIGHTS must save all! There’s a strange tablet at the Knightonia Official Museum of Art (KOMA) and nobody knows what it is. Well, almost nobody. The Cloud of Monstrox tells Jestro that it is, in fact, one of the Forbidden Powers (being gripped by a cool ROGUL statue) and they must get it (the museum curator, a snooty art critic, claims it’s the “rock that ties the whole room together.”) But their planned infiltration coincides with the big Museum Gala presided over by…Princess Macy (“I hate it when my princessly duties get in the way kicking some butt.”) With many of the important folk in the kingdom in attendance (Lance’s parents, Jorah Tightwad, Mayor Coughmeier, Roger the Scrubber, etc.) they’re going to be there to visit the most extensive collection of sculptures ever assembled in the kingdom. We’ll see versions of famous sculptures: The Thinker, the Discus Thrower, Atlas, etc. The curator of the museum hates Arnoldi and uses many of the Sculptor’s works as hat racks and coat stands. They hate each other. (“You always hated my work.” “Your work deserves to be hated.” The King is there; he’s doing the ribbon cutting ceremony in his Mech again. Jestro and the Cloud bring statues in the museum to life! The Knights must now battle Jestro and his living statues to get the Forbidden Power at the museum: CRIPPLING CRUMBLE, which causes rock, stone and other structures to crumble. The Sculptor takes a special glee in his works being brought to life and chasing the curator around. In fighting over the power, Jestro is forced to use its power to escape, he make all his living statues, and the museum itself crumble. The Knights are barely able to get the guests out of the collapsing building in time. We see what heroic leaders ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/72/22/f3ae83116855f029eb7c5b7d89af2cc6.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/dc/f3/10369508/s10369508.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/44/e5/88a901b362c58acb2866f7e41fc415e0.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "Hot Rock Massage",
            "description": "The old Lava Monsters are back! And a Forbidden Power is in the middle of their new village of Burningham. But whose side are the Lava Monsters on? Jestro and the Cloud have located another forbidden power: BLAZING BURN. They find it in the village of BURNINGHAM. The Forbidden Power is in the center of the town square with a Rogul Statue. But, we discover something odd about this village: it is populated by the old Lava Monsters that came out of the Book of Monsters and were freed when the Book blew up. And…now they’re all hippies, trying to live together in peace and harmony (“make fire, not fighting.”) They have lots of “fire sales” of fire related products and are generally peaceable. But when Jestro attacks them, they send Magmar (he’s renounced his general title) to the Fortrex to beseech the Knights for help (“Well, this is awkward, isn’t it?”) The Knights agree to help, it’s what they do, and they go to Burningham and fight WITH the Lava Monsters against Jestro. Jestro must have that Forbidden Power! But during the fight, the Lava Monsters, helped by the Knights, stage an elaborate ruse and paint Beast Master up to look like the Rogul statue. Jestro runs off with it and the Cloud finally has to tell him he got the wrong “stiff.” So where’s the real FP? Turns out that Magmar gave it to the Knights who are keeping it safe in the Fortrex where Merlok 2.0 and Ava can study it. Clay and Merlok again brief the unseen person who will be Clay’s replacement. It can’t be Lance…can it? During this episode, Lance has problems with his Knight-Pad. It crashes and he didn’t back it up. Ava gives him a lesson in backup and recovery and explains that she has Merlok 2.0’s system backed up automatically to Merlok’s library servers in Merlok’s castle tower. “ You always gotta have redundant systems.” Maybe ther is important forgotten memory there?",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/a2/cb/093ba6b1b4f2a04fddb0964cdd1dabe1.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/d1/8f/10369509/s10369509.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/2c/08/53a13ad7759a95143f0df062cfc2917c.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "Rock Bottom",
            "description": "Macy is mad! The three Harpies have kidnapped her mom Queen Halbert. The NEXO KNIGHTS use everything in their power to rescue her. But is kidnapping the real plan or is the Cloud of Monstrox after something else? Jestro delves into the dark side by kidnapping Queen Halbert! She’s taken from the Palace by…THE HARPIES – three stone sisters who work as a team. The King is outraged and stomps around in his Mech. Macy, the Knights assure him they’ll get the Queen back, and they take their vehicles and race off after the Harpies who have been tracked to the HINTERLANDS – a rocky place of desolation. Macy is so mad she can hardly think (Clay and Merlok 2.0 reflect on this…she’s the future monarch; will she make a good leader of the Knights? Is it too much to risk?) As the Knights fight the Harpies across the Hinterlands, we discover that this is all an elaborate ruse: Jestro is using the distraction to attack the Fortrex and recover the Blazing Burn Fobidden Power! He uses the Three Brothers’ Vehicle to ram the Fortrex and take the FP! But the Knights can’t help; they’re focused on saving the Queen. As the Knights get bogged down fighting the Harpies and their allies, Clay takes the lead in his Battle Suit and moves off to save the Queen as the others deal with other Stone Monsters. “Trust me…I’ll save your mom,” Clay tells Macy. Clay races off and finds the Queen being halued away in a strange prison vehicle driven by an ELECTRICAL WITCH (Ruina Stoneheart). Merlok 2.0 sends him a perfect COMBO BATTLE SUIT DOWNLOAD and he uses it to rescue the queen. As the Queen escapes she finds the other Knights finishing off the Stone Monsters. “Clay…he saved me,” says the Queen. As the Knights race over to find Clay, they find his Battle Suit, in a victorious triumphant pose and we tons of monsters turned to statues around him during the fight. The Knights are overjoyed! Clay did it! But then, they move to get Clay out of his suit they discover that ..",
             "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/ad/c6/94c7063406746550afb46e2fc88f41b8.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ed/b3/10369510/s10369510.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/5a/97/b4c0d332fb4c9e2b8126795761d21690.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "In Charge",
            "description": "The Cloud of Monstrox is growing more and more powerful with every Forbidden Power Jestro inserts. The capitol of Knighton is under attack. The Fortrex is damaged and Clay is turned to stone. Dark clouds are truly gathering over the realm.  Things seem dire: Clay has turned to stone, Jestro has taken the Forbidden Power the Knights were safe-keeping, and the Knights seem leaderless. At the start of the episode, we see Jestro plug the FP of Blazing Burn into the standing stones atop Mount Thunderstrox. Something happens: The Cloud of Monstrox laughs with triumph and grows dramatically in size. It uses this lightning to chisel into Mt. Thunderstrox to reveal a face: the giant stone face of the COLOSSUS. The Cloud explains that it is their ultimate goal – get ebough Forbidden Powers locked in the Colossus’ crown, and then bring it to life. “The Stone Colossus,” says The Cloud. “He will soon come to life and we will use it to lay waste to this land.” But, right now, there are other things to do. The big, roiling black cloud leads Jestro off toward KNIGHTONIA! His real goal in this episode? Use his now his huge self and over powered lightning to overload and destroy Merlok 2.0’s core memory being stored in Merlok’s Tower at the castle. If they can do that, Merlok 2.0 will never remember how to defeat the Forbidden Powers. As the cloud advances towards the capitol, the Cloud rains lightning to bring many, many small statues to life to help in the fight. Alarm bells ring in the damaged Fortrex. As the Knights put the stone Clay in the command center (“You must act as if he is still with us…still normal,” Merlok instructs them. Lance LOVES this idea. “So, I can call him uptight knight all I want and hear nothing back?”) they realize they’re defeated, leaderless, and don’t know what to do. They see the Cloud advancing on the capitol. “We must do something!” Macy pleads. “We will,” says Aaron stepping forward. “It’s time for me to ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/92/b8/6955494141a49b708b27d4d97d5536a0.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/37/99/10369511/s10369511.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/93/04/5e5c0bfa887a2964868812c25c4e8ffa.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}