{
    "season": 4,
    "episodes": [{
            "number": 1,
            "title": "Weekend at Halberts",
            "description": "Party time in Knighton! The mood is down so the King decides to throw a party. In the meantime Jestro attacks the Fortrex, but he is confronted with the new NEXO Power \"The Wedgie of Doom\". Clay is turned to stone and everyone is gloomy. Especially King Halbert. In order to get everything in a better mood Aaron organizes a celebration. The King wants a reenactment of Clay’s heroic rescue of the Queen. He is (as usual) totally unaware of Clay’s situation. In order not to disappoint him further, the Knights get a remote control for Clay’s Battle suit and is thus able to “perform” as Clay. Lance is happy to exercise his acting abilities and quickly gets into the role of the uptight knight of knights. Ava is working on reinstalling Merlok 2.0 into the Fortrex with Robin. She is also preparing the Fortrex for a visit from the new Knights’ Academy novices. It is a fieldtrip with Principal Brickland and Sir Griffiths with the goal of teaching the kids about these new so-called High-tech battle strategies. Not really feeling it for anything modern, it quickly turns into a regular trip back memory lane for Brickland and Sir Griffiths. This out of control excursion is an excellent moment for Jestro who is looking for an opportunity to cheer up the defeated Monstrox. Unfortunately, for Jestro, Ava is able to make Merlok 2.0 functional again, and the Novices are able to fight Jestro and his monsters off using the NEXO Power: Wedgie of Doom. It is a humiliating defeat. Apparently, this is just what the doctor ordered for Monstrox. A good laugh at someone else’s expense. His evil mood is back on.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/96/9c/afd31847ad0ced752e06dea9ff911217.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/0a/a7/10369512/s10369512.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/63/1b/5373f59ce45435f7c26f0f7bdd815a13.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "The Gray Knight",
            "description": "Using his Stone to Life magic the Cloud of Monstrox turns Clay into a living, fighting, breathing stone fighting knight. But will Clay use his forces to fight for good or for evil? Does he have a choice? The Cloud of Monstrox and Jestro are able to unlock the forbidden Power Shocking Scare and unleash an attack on the village of Bravington. Knights in their new vehicles rush to the rescue and are able to defeat him with a new Combo Power. In the heat of the battle, the Cloud of Monstrox sees the stone statue of Clay and zaps him to life! Clay is now turned, and is fighting against his friends. It is impossible for them to defeat him without destroying him for good. The Cloud urges Clay on. He attacks the Fortrex in order to get to Merlok. Robin in his Black Knight Mech is trying to stop him, but to no avail. Merlok 2.0 is left undefended. At the very last moment Merlok 2.0 unleashes a blasting spell that sends Clay far far away.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/c4/5b/4fd01dbcdcd1765a5b945abf77849145.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/7d/47/10369513/s10369513.m3u8",
            "subtitles": [{
                "url": "",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "The Good, the Bad and the Tightwad",
            "description": "Clay wakes up in the poor town of Nothing Hill which literally have nothing. Will Clay remember who he is and what he is fighting for. His friends try to help him, but Jorah Tightwad and his Bots get in the way. Clay as the Gray Knight wakes up far away in a place called Nothing Hill. A poor town where they literally have nothing. They harvest dust. Jorah Tightwad though has found that there is gold underneath the town. He convinces the confused Clay to help him put pressure on the poor townsfolk to give up their lots. This is an easy job for the strong Gray Knight. The NEXO KNIGHTS finally track him down and tries to convince him about who he is. But to the Gray Knight they are still his enemies, and a giant battle ensues in order to subdue the Gray Knight. At last, only Macy is left. When she begins to recite the Knights Code, some words and their meaning are able to get through the stone hard shell of the Gray Knight and the Evil that clouded him seems to disappear. Together they are able to return the ownership of the town to the villagers.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/1f/ac/9882bc0f783456e7adda684060a028de.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/24/e3/10369514/s10369514.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/0f/9b/09d580f99fa1142f8d13554f403304d1.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "In his Majesty's Secret Service",
            "description": "The NEXO KNIGHTS decide to use Clay to infiltrate the enemy camp. But first Clay needs to learn how to be a good spy. Agent Shield, Jack Shield helps them with that. Since the Cloud of Monstrox and Jestro are unaware of Clay’s situation, the NEXO KNIGHTS decide to let Clay go undercover and infiltrate the Stone Stompers. Clay gets the help of Jack Shield who is his majesty’s secret agent who is a specialist in infiltration and espionage. Clay has to undergo hard training in how to remain silent and unnoticed. Which is quite a challenge for a man in armor plates. Robin is intrigued by all the cool agent gadgets and follows Clay from a distance. Hidden. Clay convinces Jestro and the Cloud of Monstrox that he is still very evil, Jestro spills their master scheme of using the Forbidden Powers to unlock the Stone Colossus. They find Robin spying around outside their camp and Clay has to get rid of him. However Clay lets him go, and his cover is blown and he gets captured by General Garg. Luckily, the Nexo Knights in their Battle Suits has been following along not far away ready to intercept. Now is their moment. They manage to free Clay and fight the Stone Stompers. In that fight Clay is going “berserk” and the Knights are a bit shocked by this new chaotic behavior. When he fights Ruina (Witch) something holds him back. And we are left with wondering how that can be.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/8e/ca/d2033e5d8335b75fd145b61e95a243a5.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/3e/bc/10369515/s10369515.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/8a/3d/9dc1b52347a6d6ee2ed89e680566153a.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Stranger in the Halps",
            "description": "Jestro and the Cloud of Monstrox builds a new stone army from giant building blocks to crush Knighton. The NEXO KNIGHTS try to convince Rockowski, a demolition experts to help them.  The Gray Knight ambushes some more of Jestro’s monsters and uses a COMBO NEXO to destroy them.  He’s very, uh, vengeful.  But this is his, cold, stony mission – seek vengeance for the good of the Kingdom.  Macy misses the “old” Clay.  They gentle, but just, knight.  Meanwhile, Jestro and the Cloud need more minions and fast!    They find the FORBIDDEN POWER of DEVIOUS DEMOLITION.  They use to wreck a village and then Arnoldi chisels faces onto rocks, pillars, debris, etc.  Then the Cloud of Monstrox brings them to life with his evil, zapping lightning. Now Jestro has a quick, make-shift army.  Lance says they shouldn’t worry; the “Avenging Gray Knight” will just turn Jestro’s army into gravel again.  But Clay is nowhere to be found.  He’s gone off into the wilderness to “commune with the rocks.”  Merlok 2.0 is quite worried about him.  Forced to deal with Jestro’s makeshift army, the Knights come across the Big Rockowski; he’s a legendary demolition expert and slacker rock monster.  Rockowski lives in the Halps – the big mountain range in the kingdom – and really doesn’t want to be bothered about stuff.  He’s been living peacefully in a little valley with his pet rabbit, Bunny.  But now the Knights need him (the COMBO NEXO Triangulator is down…again) so they need his demolition skills.  He’s not sure he wants to help until Bunny’s entire family – of many rabbits – show up at his rocky plateau in the Halps.  Jestro has destroyed their forest.  And, to make matters worse, the Cloud turns one of Rockowski’s favorite boulders into a monster.  Rockowski agrees to help the NEXO Knights if they can get that big rock that Jestro turned into a monster back.  (It’s the rock that tied “the whole room together.) The NEXO Knights agrees and ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/cd/66/159903f886c37dc42f70a55224b3034b.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/8e/01/10369516/s10369516.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/40/09/09a3f7356cf96198ab36a4f02083bbc5.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "Krakenskull",
            "description": "Jorah Tightwad is digging for gold but finds the ancient Lord Krakenskull buried with his army. This stone army is exactly what the Cloud of Monstrox needs. Always afraid to end up poor, Jorah Tightwad is digging up a large portion of his property near his castle to build a vault for his money.  “I can rent it out to other people as well to store their money and then I’ll just keep their money.  That’s a quality business model.” “The interest will eat up their savings and I’ll just keep it.”  What the Tighty Knighties – who Jorah’s now employed to dig this vault since their last album bombed – find as they dig is a whole bunch of STONE WARRIER STATUES.  There’s even a statue of their leader, GENERAL CRACKENSKULL (a very cool Stone Knight on a Hellhound.)  Jorah’s advisors – two twin squirebots, LOTTA BUDGET and LOTTA FUNN, advise him to “sell the statues” and to “have fun with the statues.”  Lotta Budget prevails and Tightwad decides to sell them to Jestro and the Cloud of Monstrox, who, he’s heard, need an army.  Jorah gets gold – which Jestro pillaged from some nearby towns – and the Cloud brings the Stone Warriors and Krakenskull to life!  (They promptly steal back the money Jestro paid Jorah AND make off with all the other money in Tightwad’s vault!)  Jestro and the Cloud use Krakenskull and his warriors to track down the Forbidden Power of CRACKING QUAKE.  They then use this power to…attack the NEXO Knights!  With Crackenskull and his warriors, the Knights are almost overwhelmed until…Clay returns! (He was wandering around, finding himself and training as the Gray Knight in Episode 405.)  But now he’s back with a vengeance and the Gray Knight drives them off!  He saves the NEXO Knights and tells them that he will get his ultimate revenge on their enemies.  He will utterly destroy Jestro, the Cloud, and ALL the monsters!  (Aaron calls him “The Determinator” because he’s so determined.)  During Clay’s ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/44/f2/355f65943a0576ccb32f67cb27b5895e.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/36/e1/10369517/s10369517.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/18/67/349c46bd9bec20c158673492b249b04f.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "Heart of Stone",
            "description": "Clay Moorington the NEXO KNIGHT have had enough of Monstrox, Jestro and their Forbidden Powers and decides to take the fight to them. But the Cloud of Monstrox is getting closer and closer to unleash his master plan. The chaotic good Gray Knight decides to end it all, once and for all.  No more “Mr. Softy.”  Clay makes a pledge in front of King and Queen Halbert to save their kingdom…no matter what it takes.  They aren’t sure what to make of the Gray Knight.  He seems pretty…severe.  Macy takes Clay aside.  She’s concerned.  “You can’t just do away with Jestro.”  “Yes I can. It’s something that should have been done long ago.”  As the Gray Knight goes off on his quest to destroy Jestro, the NEXO Knights follow and try to stop him.  Clay just isn’t being…Clay. Meanwhile, Jestro and the Cloud of Monstrox are on a mini-quest: using a special spell that Ruina Stoneheart uses, they’re able to track down THREE more Forbidden Powers. Now, it seems, they have the upper hand, as they only need one more FP to bring the Colossus of Ultimate Destruction to life!  The NEXO Knights, however, detect the huge signature of three FPs and Clay goes after Jestro’s monsters with a cold vengeance.  Not even the Cloud can stop the Gray Knight with his lightning!  Clay gets his hands on Jestro and looks like he’s going to throw him off a cliff!  The NEXO Knights can’t even dissuade him.  Suddenly…Ruina Stoneheart leaps in to defend Jestro.  She blasts Clay back with her magic. “I know how to stop you, boy,” says Ruina.  “Because I’m your mother!”  The shocked Clay is blasted back…the NEXO Knights now have to drag him away from the witch.  Clay is stunned and hurt.  He’s also angry; so angry he says he can’t be trusted.  He insists that the NEXO Knights contain him in some way.  They take him back to the Fortrex and put him in a magical containment field, but Clay breaks out of it just as Macy comes in to talk to him.  He “attacks” ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/be/1a/b1787280b2b825789874e26e0f8f6f97.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/76/1d/10369518/s10369518.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/57/34/a407ec25fd92d1d8d6faa093a6179740.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "Between a Rock and a Hard Place",
            "description": "Things are getting dire in Knighton. Jestro and the Cloud of Monstrox only need the Forbidden Power of Awesome Annihilation in order to reveal what's hidden in Mount Thunderstrox. It can't be nice. Clay is locked in the Command Center, as a statue.  Merlok can tell he's angry at the world, even through his granite skin.  Merlok 2.0 understands: Clay's incensed because Merlok lied to him about his mother.  Merlok uses a powerful spell to reverse the stone in Clay's body. Clay becomes human again, but doesn't feel like himself.  Macy comes in and begs forgiveness and Clay says it's not her fault.  It's MERLOK's fault.  What is going on?  Merlok finally must explain Clay's past: you see, Clay has tremendous magical ability.  But everyone in Merlok's family who has had that ability has been driven mad.  Merlok tells him, Ruina is his mother. Her real name is MERGANA and she is Merlok's sister.  She turned evil and Merlok took Clay away to protect the boy.  Merlok then used a powerful spell to turn Ruina into a statue.  She was unearthed in \"Mergana’s Garden\" by Jestro’s minions.  And now she's back. Merlok wanted Clay to be a knight. But being the Gray Knight has tapped into something magical in Clay…and now he's sort of out of control. But no time to lose the FINAL Forbidden Power is in play and it's the most powerful one yet: AWESOME ANNIHILATION!  The final FP Jestro and the Cloud of Monstrox need.  They find it near the town of Strongheim and are able to use it to totally annihilate the town.  \"Even Knightonia can't stand against the Forbidden Powers we’ve gathered!\" says the Cloud.  Meanwhile, the Knights are trying to respond to Jestro, but Clay is lashing out with his raw magical abilities.  Merlok 2.0 finally must cocoon him in the Command Center during a magical showdown.  At the very end of this episode, Jestro locks the last Forbidden Power into the Standing Stones at Mt. Thunderstrox.  The Knights arrive in the Fortrex, having ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/ff/cf/cc73d8589b9629ff3714acd482dd6256.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/e1/18/10369519/s10369519.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/7f/89/215d9e00329f55f47530a123cf5c7e82.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "March of the Colossus",
            "description": "The giant Stone Colossus is marching on Knighton. Ruina the witch tries to get to Clay, but the other NEXO KNIGHTS need him in their final defence of the realm. Which side will he choose? Family or friends? The Colossus marches across the land, destroying all in its path.  The NEXO Knights don’t know how to stop it.  In the meantime, Merlok dispatches Robin to Merlok’s Tower in the capitol to complete his secret project (which we’ve seen references to in other episodes.)  Clay is off, somewhere, finding himself.  Will he return to the Knights?  Merlok is unsure (but secretly tracking Clay.  He wants his nephew to realize all he has been through and return to the Knights on his own.  Only then will he realize his true destiny)  In the place Clay is wandering, he’s confronted by…Mergana, his mother.  Why fight Monstrox, she asks him?  Join them!  She, Clay, and Monstrox would make an unstoppable COMBO.  Clay thinks on this.  Meanwhile, the Knights try to battle the seemingly unstoppable Colossus Monstrox as it marches towards the Knightonia.   It looks like there is nothing they can do.  Just then, things look their most dire, Clay returns.  He will lead the knights against this threat.  They can do it.  He has faith in them.  THEY’RE HIS FAMILY!  With Clay at the lead, the Knights scale the Colossus in BATTLE Suits trying to reach the head.  Ava and Merlok have determined that they must destroy the Forbidden Powers in the Colossus’ crown to bring it down.  As the Colossus crushes Snottingham, the NEXO Knights attack in the Battle Suits!  Axl gets swallowed (fights from inside the stomach…) Aaron flies into the colossus ear (upsetting his balance and causing ringing in the ears since Aaron uses his crossbow guitar.)  Clay and Macy try to attack the FPs in the crown, but the Colossus shakes them all off; it’s simply too big and too powerful.  Before they can regroup, Jestro arrives with Mergana and she uses her powerful ..",
             "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/09/78/ca3773e496ee2ea29edfbaa92c855e71.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/86/b6/10369520/s10369520.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/5e/da/72554afcdfbf537b04a030f4aa99138d.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "The Fall",
            "description": "The Cloud of Monstrox is inside of The Stone Colossus and it now stands in front of Knighton. The students of the Knights Academy are mobilized, the King and Queen are on the defence and the NEXO KNIGHTS are ready for the final showdown. The Monstrox Colossus attacks the city!  The entire city has turned out for defense as Robin continues his secret project in Merlok’s Tower at the castle.  He’s using some of the Knightmares Team from the Academy to help.  The King and Queen and Brickland and Sir Griffiths are seeing to the city’s defenses – all being coordinated by Clay from the Fortrex.  He’s more driven that before (and, showing off touches of his magical talents.)  Meanwhile, Ava is trying to get some programming done; with Techcalibur having been damaged (in Episode 310) she must find a way to transfer Merlok in an emergency.  As Jestro and Mergana arrive with a horde of monsters arrive just in time to see the Colossus crush the Fortex!  It smashes it to bits!  Merlok goes off-line!  Ava is okay, she is working on a contingency plan to get Merlok out of the Fortrex.  It looks like he’s done-for as the Knights retreat to the King’s Castle.  They finally find out what Robin is working on…turning Merlok’s Tower into a ROCKET to fight the Colossus!  The Colossus stomps down the walls of the city!  It starts destroying things!  This looks like THE END!  Clay says they must launch the Rocket Tower as their last hope.  But before they launch, they get a call from Ava.  She’s got another passenger for them…Merlok steps out of the battered Fortrex in Robin’s old Mech and is now…MECHLOK!  He can now directly use his powerful spells in battle!  He races off for the tower and gets there just before launch!  As the Colossus continues its destruction of the city, Brickland, the King and Queen and Sir Griffiths try to hold off Jestro, Ruina, and the monster horde.  Finally, the Rocket Tower launches and the NEXO Knights, in ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/84/25/6ac1cd424a18060d197a67349fc79ea8.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ff/0d/10369521/s10369521.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/de/6d/d8b5e31018b6a35d930817b86a01714a.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}