{
    "season": 1,
    "episodes": [{
            "number": 1,
            "title": "The Book of Monsters, Part 1",
            "description": "When Jestro the Jester finds the Book of Monsters, chaos breaks loose in the Kingdom of Knighton.  Can the newly graduated Knights from the Knights’ Academy save the kingdom? It’s final graduation fighting exams for the latest Knights from Knights’ Academy.  All our new Knights demonstrate their prowess: CLAY, AARON, AXL and LANCE.  PRINCESS MACY get to join them, but her father doesn’t want her to graduate.  As part of the entertainment, MERLOK does an amazing magic trick.  His act is followed by…JESTRO, the King’s Jester.  He’s terrible (and he should know to never follow a better act.) Everyone laughed because he's a real joke....a total failure. While Jestro roams the halls fo the King's Castle, forlorn, he hears the BOOK OF MONSTERS calling to him from Merlok's library. The book talks Jestro into gathering as many books of spells as he can carry, but they're interrupted by...Clay! As Jestro quickly pages through the Book of Monsters to attack Clay, Merlok arrives. There's a battle in the library between Jestro and Merlok. Finally, the wizard summons up his most powerful spell in self-defence. BOOM! There's a big, magical explosion and when Clay forces his way back into the library, Merlok, Jestro and the magic books are...GONE!",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/dd/7a/b8aff5e2947ccb8496694a8e256bc56e.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ec/d9/10369482/s10369482.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/0d/73/e93b188421e7f6052bb2ec97f5956a69.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "The Book of Monsters, Part 2",
            "description": "Realizing they must defend the Kingdom from Jestro’s monsters, the Knights try to organize but are despondent when they discover their best advisor – Merlok the Magician – has sacrificed himself to save them.   When Jestro awakens, he’s been blasted miles and miles away from the King’s Castle by Merlok’s explosive spell.  And, it seems, all the books he was trying to steal have been scattered, too.  The Book of Monsters broke Jestro’ fall and now he can use the book to attack the people who laughed at him.  Meanwhile, the King and his newly-trained Knights pick through the rubble of Merlok’s library.  They’ll have to figure something out, because Jestro and his newly made magic monsters attack King’s Castle!  Clay organizes the Knights to defend the kingdom, but they’ve never worked together before.  It takes all their training, plus the help of an old friend…MERLOK!  Only now he’s MERLOK 2.0.  Ava has been piecing together what happened and discovering that the “ghost in the machine” she’s been chasing is really Merlok in digital form.  Now, he can use his magic digitally and he downloads just the right weapons to the struggling Knights!  They finally foil Jestro’s attack with Merlok’s help and officially become NEXO KNIGHTS!",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/c6/d6/7d5fbcc2c64cd6084ef067e3b3a6907c.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/75/84/10369483/s10369483.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/76/6c/2f9fe506f63c45586896f23d4824992d.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "The Power of Merlok",
            "description": "When Jestro attacks a village on the far side of the Kingdom, the NEXO-Knights wonder how they’ll get there.  Then Macy remembers her dad has a royal RV…maybe they can “mod” that for their own, “knightly” use? Now the NEXO-Knights get rolling…in THE FORTREX, their own ROLLING CASTLE!  This great new HQ, which houses Merlok 2.0 as an operating system, will be how the knights move around Knighton and protect it from Jestro and his monsters.  Speaking of the evil jester, in this episode Jestro uses some newly-made monsters to attack a town far from the capitol where he thinks he’s safe from the Knights’ reach.  We see two parallel stories here: the Knights training, learning more about digital magic and getting organized as a team and at the same time we see Jestro making monsters, trying to learn how his powers work and talking to the Book.  In the end, the Knights roll up in their castle and defeat Jestro and his marauding monsters.  Lance thinks he should be the leader because he’s a snot. “Of course I’m the leader…I’m a Richmond.”",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/41/6c/2c664e7b72ab1ca93a394f2ec0feabd1.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/e0/45/10369484/s10369484.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/f1/12/fbdc2c88555ae5c0216722e1ae5233e9.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "The Knights' Code",
            "description": "Jestro uses the Book of Chaos to unleash, um, chaos and attack the King’s hover train to try and kidnap the royal party.  Can the NEXO-Knights bring order out of the chaos and save the King? Jestro finds the Book of Chaos in the countryside and decides he must feed it to the book.  The Book of Monsters actually tells Jestro NOT to feed it to him; he tells Jestro he’s not ready for that kind of power.  But Jestro doesn’t listen.  Now the Book unleashes chaotic monsters and Jestro uses them to attack the King and his party who are on a business-related tour of the kingdom. When the NEXO-Knights show up to stop the monster attacks and realize that they must save King and Queen Halbert – Macy’s parents – from the chaotic evil monsters that have been unleashed.  Clay asserts himself as leader and brings order to the knights from the chaos.  He has his own book: the Book of the Knight’s Code.  They should all live by it.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/2e/07/773e202a5399f6fc50b6b7bf204571d6.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/f7/f4/10369485/s10369485.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/91/bd/1e7a08dd0b052f0db07cbd36b8b9c79b.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Fright Knight",
            "description": "Using the Book of Fear, Jestro calls forth Whipperella and uses her to trap the knights in the dark woods where they realize their darkest fears. Searching through the dark forests of the realm, Jestro finds “The Book of Fear.”   It’s pretty scary.  But he feeds it to the book of Book of Monsters, and he uses it to call forth WHIPPERELLA, a monster that can induce fear.  One-by-one she uses her “knighmarish” power on the knights and they experiences their own worst fears.  Clay fears not living up to the Knights’ Code.  Lance fears being a nobody.  Macy fears never being a knight and Axl fears having no food.  Aaron must take the lead because he’s fearless; he does everything with reckless abandon.  It’s not until he leads the group out of the forest – as they fight off the Whipperella – that they we find out Aaron’s true fear – the fear of peace and quiet and no more challenges or high energy escapades.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/a4/e4/01f3b904e2cc8dc29e2341db46033a9b.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ba/bb/10369486/s10369486.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/72/fc/b92198487f24c7c005ca4a6178c22e2c.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "The Golden Castle",
            "description": "When Lance is cast as the star in the new remake of the classic movie “Ned Knightly and the Golden Castle” he doesn’t anticipate Jestro and his monsters invading the set and ruining his starring role. It’s movie time!  Lance does something very Lance: he agrees to star in a movie about remake of a classic film in Knighton: “The Golden Castle.”  While pillaging a village, Jestro and the Book of Monsters see a movie poster for “The Golden Castle” and the book says the legendary Golden Castle is filled with riches!  Jestro explains that it’s just a dumb movie and that it’s not real.  It’s all based on a “script.”  The Book, who’s been shelved for many years, wants to eat the movie script to learn more about the modern world.  On the set of the movie, Lance has invited the other Knights to act as extras.  When they see how Lance is being portrayed, they’re incensed.  When Jestro attacks the movie set to get the script for his book to eat, the film director keeps rolling.  This battle footage is fantastic!  The Knights defeat Jestro even though the movie set is trashed.  The director will make it work.  At the premier of the movie, Lance is embarrassed to see that he’s been reduced to comic relief for the realm’s bravest Knight…Macy!  The director has now made her a star.When Lance is cast as the star in the new remake of the classic movie “Ned Knightly and the Golden Castle” he doesn’t anticipate Jestro and his monsters invading the set and ruining his starring role. It’s movie time!  Lance does something very Lance: he agrees to star in a movie about remake of a classic film in Knighton: “The Golden Castle.”  While pillaging a village, Jestro and the Book of Monsters see a movie poster for “The Golden Castle” and the book says the legendary Golden Castle is filled with riches!  Jestro explains that it’s just a dumb movie and that it’s not real.  It’s all based on a “script.”  The Book, who’s been shelved for many years, wants to eat the movie script to learn more about the modern world.  On the set of the movie, Lance has invited the other Knights to act as extras.  When they see how Lance is being portrayed, they’re incensed.  When Jestro attacks the movie set to get the script for his book to eat, the film director keeps rolling.  This battle footage is fantastic!  The Knights defeat Jestro even though the movie set is trashed.  The director will make it work.  At the premier of the movie, Lance is embarrassed to see that he’s been reduced to comic relief for the realm’s bravest Knight…Macy!  The director has now made her a star.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/51/f8/016cace7d45cb448682a22cb3305903a.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/65/d0/10369487/s10369487.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/00/ac/31a4f5711c3b186af374f39e045d861e.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "The Maze of Amazement",
            "description": "The Knights find themselves trapped in a maze looking for the Book of Deception.  But will they actually get their hands on it, or will it keep deceiving them? The Knights travel to the Hill Country in the northern part of Knighton to Axl’s home town of DIGGINGTON (where they realize that all of Axl’s family look just like him.)  While they’re there, Merlok 2.0 detects something…one of the Magic Books!  It’s “The Book of Deception.”  They go to find it and discover it ended up under a mountain.  And, to make matters worse, the magic book has built a maze around itself to keep it from being found (it is deceptive!)  As the NEXO-Knights enter the maze from one side, Jestro enters from the other; the Book of Monsters has led him to the maze to get The Book of Deception, too.  It’s a race through this confusing maze to see who can get the book first.  Ava figures out the maze is the Whackman maze from a videogame.  After help from Axl’s people to defeat Jestro and win the book, the knights discover it’s a FAKE BOOK of deception.  The Book of Deception created a fake copy of itself!",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/32/36/6a92d2956f36fd9e7220adc797d809b9.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/4d/b5/10369488/s10369488.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/d3/f0/5b64862cf63583ce9bd4809e955b6204.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "The Black Knight",
            "description": "It seems the NEXO-Knights are attacking villages throughout the realm!  But why?  A mysterious Black Knight appears to defend the cities from the rogue NEXO-villains! Jestro, happy he has the REAL Book of Deception, uses it to create bad versions of the NEXO-Knights.  The “fake” knights then attack villages and hamlets.  When the real NEXO-Knights arrive, they’re booed and pelted with food.  Why does everyone hate them?  To make matters more confusing, a giant Mech Suit in black – The BLACK KNIGHT – appears to defend the kingdom’s villages from the fake knights.  The Black Knight ends up being very powerful and throws Jestro and his fake knights for a loop.  He’s cool and mysterious.  But when the fake Knights get the better of him, the REAL NEXO-Knights appear to fend them off and learn their deceptive secret.  The Knights save the Black Knight and they open him up to find…young ROBIN!  (He used a deep, deceptive voice.)  The Knights realize that Robin has potential.  But maybe he still has some learning to do.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/89/13/eb1d30b6e7b12a226a3486efa856c43b.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/19/4a/10369489/s10369489.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/ee/e3/ec0a770a5ef492bdba82d7c2b5bb8c69.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "The Book of Total Badness",
            "description": "The NEXO-Knights must fight Jestro's Monsters of Destruction which are attacking all over the Kingdom.  But Merlok smells a trap…is he right? In a dark, destroyed part of the kingdom, Jestro arrives at the ruins of a HUGE castle.  The Book of Monsters knows this place: the great evil wizard Monstrux lived here.  The Book sniffs out some powerful magic in the ruins: “The Book of Destruction.”  With this, The Book tells Jestro they can destroy the NEXO-Knights and then attack the King's Castle and cause massive destruction.  Jestro creates destructive monsters and sends them all over the realm, so the Knights must separate and fight single combats all over the place.  The Knights lose these battles (lesson: they have to work as a team!)  And, just when the Knights are scattered across the Kingdom, Jestro attacks the King's Castle!  It looks like all is lost.  When Aaron, who has escaped, returns to see Jestro's attack, he realizes he must gather his fellow Knights.  Merlok says it's very dangerous, but Aaron says he must take the risk to gather the Knights and save Knighton.",
             "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/76/2d/101a20d9dab713c8ff526366be9c016e.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/95/4b/10369490/s10369490.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/be/e7/76b640ef5e830e81b9220426d60d304e.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "The Might and the Magic",
            "description": "Aaron races across the kingdom to gather the NEXO-Knights as Jestro and his Destructive Monsters attack the King’s Castle.  The Knights must get back to the capitol in time, or Jestro will rule the kingdom! Jestro, while still attacking the King’s Castle, has second thoughts until the Book of Monsters orders the mad jester to feed him another magic book he’s found (and has been saving.)  It’s the powerful “Book of Revenge!”  Now, combining the powers of Revenge and Destruction, Jestro and his monsters will get their vengeance on King Halbert and the Kingdom of Knighton.  Jestro and his monsters lay siege…will they destroy the castle?!  Meanwhile, Aaron races across the Kingdom gathering the NEXO-Knights one at a time.  As each Knight rejoins the group, they become a more and more powerful team.  They even get Robin to join them as the Black Knight in his repaired power suit.  Our Knights arrive, finally regrouped, fight off Jestro, save the castle and the King.  It’s a glorious victory!  The King is so pleased after seeing how the brave NEXO-Knights saved his kingdom, he allows Macy to join them as an official NEXO-Knight.",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/c5/44/ac897b309a32f2ee561fe3dca3f30044.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/4e/77/10369491/s10369491.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/07/70/68b5e8a55e036a57e87a9d6597ad3fd8.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}