{
    "season": 2,
    "episodes": [{
            "number": 1,
            "title": "Back to School",
            "description": "When the NEXO-Knights are sloppy in a fight with Jestro, Merlok 2.0 sends them back to the Knights’ Academy.  Not only for a brush-up but to find out what Jestro is after in its hallowed halls. As they Knights battle Jestro – in a somewhat haphazard and lazy way – they discuss the fact that Jestro never wins and that they’re always getting over on him.  Despite defeating the jerky Jester and his evil Book, Merlok 2.0 discovers that something about the attack on the village is tied to the Knights’ Academy. It looks like that’s where they’ll strike next.  It wouldn’t hurt for the Knights to go “back to school” to watch for Jestro and for some refresher training.  Merlok is sure Jestro wants something at the Academy, but he doesn’t know what it is.  The Knights are very much “fish out of water” at the academy, even with the “cool kids” – Robin and Ava – showing them around.  The next generation of Knights is being taught to integrate the NEXO-Magic of Merlok into their fighting techniques and these kids are good (so good, they initially kick the lazy, know-it-all Knight’s butts!)  Their old principal, the ever-ornery Headmaster Brickland, sets them straight: they’re all still slackers, and they better get their acts together (especially Lance!)  The Knights take shifts as “library helpers” much to the delight of the old squirebot librarian, MARGE.  They’re convinced Jestro is after a book…isn’t he always after a book?   When Jestro attacks, the Knights help organize the students and there’s a big fight in the Academy Library versus Jestro and his Monsters.  They drive Jestro off without letting him steal any books!  Victory!  But as Jestro leaves, we see him holding what the Book of Monsters really wanted: a snow globe with a castle in it that was sitting on the librarian’s desk. In the Lava Lands, Jestro throws the snow globe into a volcano and it frees the massive Castle of Monstrux from its snowy magic prison",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/5a/ac/8bf14310de9351d866af467024bef9f7.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/a0/4a/10369492/s10369492.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/07/79/b6a76034e0daa7ac44826d23f17b8ecc.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "Greed is Good?",
            "description": "When Jestro uses the Book of Greed to rob Auremville of its riches, he also gets Lance’s parents as prisoners and these demanding rich folks are too much for even monsters to handle. Jestro’s not sure what to do with his new castle in the Lava Lands.  “Every castle needs a big chamber filled with treasure” says the Book of Monsters so they’ve got to go out looting!  The BOM convinces Jestro to call forth GENERAL MAGMAR, and Jestro appoints him as “general manager” of “castle operations,” much to Magmar’s dismay.  Meanwhile, Jestro and the BOM find the BOOK OF GREED.  This will allow them to make greedy, rapacious monsters that will bring them all the treasure they want to fill their castle!  They’ll head to the richest town in the realm – AUREMVILLE!  Meanwhile, in Auremville, the NEXO-Knights arrive for a huge “Gold is Good” ball at Lance’s house.  When the Monsters finally arrive in Auremville, a battle breaks out and the greedy monsters make off with everything…including Lance’s parents, Goldie and Cuthbert Richmond who are clad in the finest golden garments and so look valuable!  Lance will now be forced to live…poor.  The Knights have to get his parents back.  Meanwhile, his parents – Cuthbert and Goldie Richmond –think their imprisonment in Jestro’s gold-filled castle is a “spa holiday” with the worst service.  They order Magmar and the monsters around like servants and drive them all crazy.  The Knights pile into the Fortrex and head for the Lava Lands, formulating a plan along the way to free Lance’s parents.  In a village half-way to Jestro’s Castle, the Knights run into…Jestro and his monsters headed the other way with Lance’s parents and all the gold they’ve stolen.  There’s a big fight, until they realize they might have the same goal and decide to deal.  The BOM wants to give them back all the gold and Lance’s parents.  Lance says “No deal.”  “We’ll take the gold, you can keep my ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/6f/ba/0e1d5225851fbcc9c92ab6d9b10c3eab.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/91/13/10369493/s10369493.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/2c/34/8c309cf0627b67a1d8fda5c3a0779652.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "The Book of Obsession",
            "description": "The Knights are tasked with protecting the King’s valuable Ned Knights comic book during the Bookingheim Knight-a-Con.  But with all the costumed kids there, will they recognize the real Jestro and Book of Monsters coming to get them? King Halbert instructs the Knights that they must take his valuable Ned Knights comic book to the “Knight-a-Kon” in Bookingham. It will be the first be first prize at the Knight-a-Kon.  But the Book of Monsters wants the book, too. Having devoured Ned Knightly comic books in it’s down time it has become fanatically obsessed with the storyline.  General Magmar suggests they simply attack the place and take what they want, but Jestro tells them they can’t: everyone will be in costume and they’ll be thousands of comics there.  This calls for a clever “infiltration” mission (which will also allow Jestro to see the Kon, which he’s always wanted to do.)   So Jestro goes into the Kon with the BOM and some monsters.  And it’s easy because everyone is in costume; Jestro, the BOM and their monsters fit right in at the convention and Clay and crew have their work cut out for them trying to separate fiend from fan. Macy keeps going on-and-on about the story in the King’s comic book as the Knights keep a watchful eye on it.  Robin even shows up in the “Minitrex” – a small version of the Fortrex he built just for the Knight-a-Kon.  He’s convinced he can win the costume competition that is the big closing event for the Kon.  At the end of the Kon there’s a big awards ceremony for “Best Costume.”  The prize: “Ned Knightly, Knight of Knighton, Issue #1.”  The BOM must get it and scheme to get closer to it during the costume contest.  He’s just…about…to get the book when…the impatient Magmar attacks!  Everyone thinks it’s part of the big show!  “Ned Knightly, Knight of Knighton, Issue #1” is tossed from person-to-person-to-person in the melee.  The Knights must do something, but they’re too far ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/2c/f8/d4615626ccd798368cf090c0762b07e6.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/c7/73/10369494/s10369494.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/0f/10/e147b3442aefc76086930e720facc0ee.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "The King's Tournament",
            "description": "Rival to the King, Jorah Tightwad thinks his knights – the Tighty Knighties – are easily better than the NEXO-Knights, so he challenges King Halbert to prove who’s better during the King’s Birthday Tournament. It’s the King’s birthday!  To celebrate, the Queen and Macy always throw him a great, big birthday party consisting of a feast on birthday eve and a tournament the next day.  At the birthday banquet is JORAH TIGHTWAD (last seen in episode 104.)  He’s goading the King (and on his birthday, even) and going on and on about how his knights are better than the NEXO-Knights.  The King protests, but Jorah asks “How many magical books have your knights recovered?  None, zilch, zero.”  But he produces the BOOK OF ENVY, which his superior knights captured from Jestro.  The next day, the NEXO-Knights square off against Tightwad’s four knights: JOUSTING BEEBER, BRICKNEY SPEARS, SHIA LABLADE and THE BLOK.  We see that all these knights are envious of the NEXO-Knights: their weapons, their fame, their hair, etc.  Macy is also disappointed to find out she CAN’T fight in the tournament – she’s agreed to be in “princess mode” for her father’s birthday.  During the tournament, we see that Tightwad’s knights are amazing in fighting contests.  They all pair-off with knights who have their same weapons skills.  Tightwad makes fun of the NEXO-Knights as his knights do well.  Jestro and the Book of Monsters discover that Tightwad has the Book of Envy and he and his monsters attack the tournament.  Then we learn that Tightwad’s knights might be good tournament fighters, but they can’t handle real fights and the NEXO-Knights must save them!  Macy is finally able to join in the fight when she sees Magmar show up on the flank.  The NEXO-Knights successfully defend the king, but Jestro gets away with the Book of Envy.  Tightwad must admit his knights never won the book from Jestro; he got the book when Merlok blasted books of magic across the realm. ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/0d/51/95acc19a16147f1eeb5c87ee0329e370.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/29/25/10369495/s10369495.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/95/f4/63d30f15fd3048bd6f5dfae20e4a3157.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Monster Chef",
            "description": "Axl and Chef Éclair must enter a cooking contest to try to keep Jestro from getting the hottest chili recipe in the realm. Knighton celebrity chef GOBBLETON RAMBLEY announces that he’s developed the hottest chili recipe ever created.  Now, he intends to give the recipe to the winner of his “Hottest Chili Cook-Off Competition” cooking show on Knighton TV.  He’ll turn over his famous Chili Cookbook with the hottest chili recipe on the last page.  It’s so unique it can’t be recreated without it.  Jestro and the Book of Monsters think they MUST have that recipe.  “Hot chili makes hot monsters!”  Merlok knows that this recipe, in the wrong hands – meaning Jestro’s – could be dangerous.  But when the Knights appeal to the egomaniacal chef, he says the only way to get the recipe is to win it from him.  So Axl and Chef Éclair decide to enter.  The team that creates the hottest chili will win Rambley’s cookbook.  Chef Éclair is unsure that Axl has the skills to help them win the competition, but, as we see through funny cooking show bits, Axl is quite good and they become a pretty good team.  (We will also learn that years ago, Rambley stole one of Éclair’s best recipes and they don’t like each other.)  While watching the multi-part competition, Aaron and Lance have a contest of their own: who can eat the hottest chili.  Axl and Éclair actually win the competition, coming up with a raging hot chili recipe.  Before they can claim their prize, Jestro and his monsters attack with Magmar leading the way on his siege tower.  They must get that cookbook!  During the battle, Rambley’s cookbook is accidentally melted.  After the battle, Rambley announces his new quest: to make the sweetest ice cream ever!  While Axl and Éclair cook happily in the kitchen of the Fortrex, back in the Redoubt of Ruination, Jestro and Lavaria are attempting to recreate Rambley’s chili recipe.  They keep spooning various recipes of chili into the Book of Monsters.  ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/cf/1b/41a37321c4e4a272ea2b6416776372b7.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/df/0c/10369496/s10369496.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/ef/f8/41f426f36addefd5540681e8c72a7b0c.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "Knight Out",
            "description": "When the other NEXO-Knights decide they need a vacation from Clay, they send him on a holiday not knowing that he’s going to a resort that houses an evil book or that Jestro will be heading there, too. Clay needs a vacation.  Or, actually, the knights need a vacation from Clay!   Clay is so super-focused that sometimes they just can’t take it: training, training, maintenance, the Knights’ Code tests then…more training.  Even Merlok 2.0 is exhausted and he has no physical form!  So, the Knights send Clay off on a holiday against his will (arranged by Lance because if there’s one thing he can do it’s plan a vacation.)  But unbeknownst to the other Knights, Jestro and the Book of Monsters are tracking an evil book.  A book that they suspect is located near the resort “Exalted Towers” renowned for its exquisite service, where Clay is staying.  It’s the BOOK OF CRUELTY and Clay notices that it’s affecting the “high class” resort where Lance has booked him: the service is terrible, the staff is nasty, and everyone seems to take joy in being cruel to him (and to each other.)  Meanwhile, the other Knights are having a terrible time because they realize that Clay takes charge of the basic maintenance of almost everything in the Fortrex.  Stuff starts breaking down, chores are not getting done and everyone is getting on each other’s nerves. Clay senses things are “off” at the resort, and  discovers the book they’ve been using as the guest register is really the Book of Cruelty.  As Clay scoops it up, he looks outside to see…Jestro and his monsters arrive on the Evilmobile.  Clay battles as best he can on his own by setting traps and being cunning but he’s finally caught.   Just when it looks like this will be the cruelest vacation ever; the other Knights arrive on their vehicles!  They spring into action, free Clay, and battle and defeat Jestro and the monsters – though Jestro escapes.  The Knights make Clay promise to never go on ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/7c/f0/558a988aafae016b57aaf8ee8cd0a8c6.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ea/87/10369497/s10369497.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/9e/5a/a14959b23fed8a0ddfabc93254d5d74d.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "Saturday Knight Fever",
            "description": "The Book of Monsters catching a cold means trouble for the NEXO-Knights when he can create an entirely new kind of “snotty” monster. King and Queen Halbert have journeyed to the town of Cleanington to open the brand new Scrubbery Barn at the invitation of Roger the Scrubber (seen in 104.)  Meanwhile, the Book of Monsters drags Jestro to Snottingham – one of the coldest places in Knighton where everyone coughs, has a runny nose and is generally under-the-weather.  The BOM demands that Jestro feed him a “snotheiser” ball which will probably make him sick.  The BOM explains that if he is sick, he may just produce a whole new breed of magical monsters … some that the knights would NEVER expect.  The BOM gets sick and starts coughing up phlegm globlins and bloblins.  The Knights arrive, alerted to what they think is an attack on the town by Snottingham’s mayor, Hack Coughmeier.  The sickened, sneezy, snotty monsters infect the knights and, more importantly, the knights’ NEXO-Shields. Now their NEXO-Powers are infected.  As they try to download something to fight the monsters, they realize the powers they get are off; strange, infected versions of their powers.  The knights drive Jestro and his snot monsters off and they turn in for the night.  And, overnight, they all get sick.  Meanwhile, the BOM order a nice, hot lava bath…he’ll feel fine by morning.  But the knights wake-up with colds and they feel terrible.  Ava and Merlok 2.0 thinks it will pass in a day or two…it’s just a typical Snottingham cold.  Each knight gets sick in their own funny way and their illnesses play right into Jestro and the BOM’s hands: they’re headed to Cleanington to kidnap the king!  The citizens of the ultra-clean city hate the sight of monsters, but then feel caught in between when the sick, sneezy, snotty knights arrive on their Fortrex.  The fight goes terribly for the knights.  They try to download the Nexo-power “Glorious Griffon” but instead get just ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/57/3e/7d68498adffc90dc597721f9f839adec.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/75/5d/10369498/s10369498.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/93/b7/dd9329396d8fd337e5c98c71e3ce7ca1.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "Open Mike Knight",
            "description": "The Book of Betrayal leads Jestro and his Monsters to Funnyton – the funnies town in the kingdom.  When they Knights arrive to capture him, they discover (to their shock) that Jestro and the Book of Monsters are now the town’s top comedians! Jestro and his monsters are in attack formation moving to pillage the town of Funnyton.  But when they arrive, ready to tear into the place, they see that nobody’s in town.  Then, they hear…laughter?!  The entire town is there listening to a stand-up comic JOKES  KNIGHTLY.  He’s hilarious.  He commands such power, such attention, and such loyalty.  Jestro and the BOM decide they must become funny.  They order all kinds of book on comedy from Spamazon: books on parody, irony, insult humor, slapstick, satire, knock-knock jokes, elephant jokes, “my monster is so fat” jokes, etc.  They work-up a ventriloquist act with the BOM sitting on Jestro’s lap.  They start doing their act and, surprisingly, they’re funny.  They’re very funny.   The Fortrex arrives and the knights rush out, ready for battle.  They fight through a string of monsters just outside the town, but discover they’re only working as “bouncers” to keep too many people out of the comedy club.  (“Sorry, you guys aren’t on the list.”) The knights hear loud laughs and head there.  In the club, they discover the town isn’t being held hostage, they’re in the show voluntarily having a great time.  And…Jestro and the BOM are funny.  Meanwhile, during the show, Jokes Knightly decides he’ll steal the BOM and Jestro’s act.  During the intermission at the comedy show, Clay comes backstage to talk to Jestro.  Maybe, Clay says, this shows that Jestro doesn’t have to be bad…he is funny, like Clay always said he was. Meanwhile, Jokes Knightly steals the BOM and Jestro can’t find it.  He panics.  Clay encourages him…go on stage alone, be funny…he can do it!  Jestro goes out and is funny on his own; he hits all his punchlines, he gets ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/f2/c3/70cf87bfb3cc10e9c2db0f5700ba473c.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/6d/01/10369499/s10369499.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/7f/c9/84aeb4aaf55159c70e058fce694f234d.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "The Fortrex and the Furious",
            "description": "In a massive chase around Knighton, the NEXO-Knights attempt to keep the Book of Betrayal out of the Book of Monster’s grip.  But the evil book is persistent.  Will he get the final piece of his evil puzzle? We finally REVEAL that Jestro has given the Book of Betrayal to…Clay.  He tells Clay what it is and how Mike Knight used it.  And it seems that the Book of Monsters believed it to be the final ingredient in some ‘Master Plan.”  Suddenly, they realize Monsters – led by Magmar and the super-mad Book of Monster – are after them!  Clay retreats with Jestro and the Book of Betrayal to rendezvous with the other Knights at the Fortrex.  The Fortrex isn’t fast enough; they’ll need their own vehicles. They decide that they need to split up and go in multiple directions to make the monsters expend their resources on a chase.  It’s a huge chase, being covered like a crazy news event by the Knighton News Network.  We see a montage of the monsters stopping and capturing all the Knights vehicles: Aaron, Macy, Lance…finally Axl.  However, as they do, they realize that the Knights have used Squirebots in Jestro Fan Jester hats (from the vendor at the comedy club in 108) as decoys.  They think Axl has the Book of Betrayal in his BRICK containment unit, but it turns out to be the Ned Knightly Comic from episode 203.  The Monsters finally corner Clay, who has the real Jestro and Book of Betrayal in his sword vehicle.  Before Clay can protest, Jestro pushes the launch button and fires off Clay in the vehicle’s rocket sword.  The monsters race off with Jestro, leaving the shocked Clay fearing for his friend. Now, Magmar tells the Book of Monsters, they only need to get BOB.  Clay makes his way back to the Fortrex and tells what has happened. They decide they must get to the Redoubt of Ruination in the Lava Lands and try to save Jestro.  Meanwhile, we see, INTERCUT, a scene where Merlok 2.0 and the Book of Monsters explain the Books of Evil, how they were ..",
             "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/89/c4/69048ebd8faf32073e1281251007fe7b.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/fd/41/10369500/s10369500.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/b9/54/06f736500cdc920ae0e7055cd75fd7d8.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "Kingdom of Heroes",
            "description": "The Book of Monsters, having the final pieces of his evil plan in place, tries to take human form.  Can the NEXO-Knights and Merlok 2.0 stop the greatest threat they’ve ever faced?  Or will the kingdom be plunged into darkness…forever. The Redoubt of Ruination readies the final ceremony to call forth MONSTRUX, the arch-necromancer of the past.  Clay, holding the Book of Betrayal walks to the gates of the spooky place.  Inside, Clay hears strange…singing and music.  It’s like a twisted Broadway show of some kind.  Meanwhile, the Knights all realize Clay is gone and so is the Book of Betrayal.  Macy says Clay must be up to something.  They have to trust him and, more importantly, they have to find him.  At the Redoubt of Ruination the ceremony has already begun!  The Book of Monsters wants the final ceremony that calls forth Monstrux to be like a really great show!  The BOM then barfs up all the BOOKS OF EVIL into their places around Jestro.  He’s just missing the BOOK OF BETRAYAL, which Clay has.  Clay says he’ll trade the book for Jestro.  The BOM immediately agrees to the deal and sets Jestro free.  Then, Monsters grab-up Clay, restrain him, and put him in Jestro’s place on the sacrifice stone.  From outside, they’re interrupted by the sounds of battle; the Knights have arrived on the Fortrex and are attacking the Redoubt of Ruination.  In the confusion, Jestro slips away.  The BOM lets loose with a powerful protection spell to keep the Knights out as he starts with the ceremony…he’s going to bring Monstrux out and remanifest him in Clay’s body!  Jestro is able to escape the Redoubt and make his way to the Knights, who can’t seem to battle their way in.  It’s a race against time as the Knights try to get in and save Clay.  As the Knights get in, they see that the crazy BOM is absorbing all the Books of Evil, one-by-one.  He grows BIGGER and BIGGER!  Macy calls for NEXO-Power…but it’s not enough!  The gigantic Book of Monsters sucks ..",
            "thumbnail": "https://cdn1.futuretodayinc.com/files/a8wn4hw/im/bd/96/5ab36ef5b3490fce262536dd739d6171.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/7c/e0/10369501/s10369501.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/fc/33/4e9ae550a69859d6d9663f10b8faffe0.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}