{
    "season": 2,
    "episodes": [{
            "number": 1,
            "title": "Darkness Shall Rise",
            "description": "Just as the rebuilding effort in Ninjago begins, the four ninjas come to realize that evil has started to resurface with Lord Garmadon forging the ninjas’ lost Golden Weapons into a Mega-Weapon with unspeakable powers. With the Devourer destroyed, Ninjago is saved and the rebuilding effort begins. Without their Golden Weapons, the Ninja are stripped of their elemental powers. And with their flying ship ‘The Destiny’s Bounty’ destroyed, the Ninja are forced to find a new home in the city. Meanwhile, Lord Garmadon resurfaces and gains control of the Serpentine as well as transforms the Bounty’s wreckage to become ‘The Black Bounty’.  The Ninja will battle Scales and discover evil has begun to resurface in Ninjago, while Lord Garmadon will successfully forge the Golden Weapons into a Mega-Weapon with unspeakable powers.",
            "thumbnail": "https://image.tmdb.org/t/p/original/jjtClNz0HPeIbO8FXrnJlaFHa6J.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/57/82/10369164/s10369164.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/d8/2e/fab3c75c972681a3ad04137fe06d331b.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "Pirates vs. Ninja",
            "description": "When Garmadon by accident brings to life the original owners of the Black Bounty – the ruthless Captain Soto and his Pirates - it is up to our ninjas to stop them from plundering Ninjago City. Sharing a tiny, one-bedroom apartment in the city, the Ninja take Lloyd to Grand Sensei Darreth’s Mojo Dojo to begin training. There, they discover Lloyd has all four of their natural elemental abilities. Meanwhile, Lord Garmadon discovers his Mega-Weapon can’t destroy, only create what the user wishes. By accident, Garmadon brings to life the original owners of the Black Bounty: Captain Soto and his Pirates, and they mutiny the ship. Answering the age-old question of who would win a fight between pirates and ninja, it’s up to our ninja to stop Captain Soto and his men from plundering Ninjago City. In the end, Ninjago City is saved, the Pirates are arrested and Lord Garmadon escapes once again with their Black Bounty.",
            "thumbnail": "https://image.tmdb.org/t/p/original/wTnmJvk5Q4hYaCz10lxqlnzj219.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/e4/dc/10369165/s10369165.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/1e/5a/fa3683aba7557828374e88f5ad5729d7.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "Double Trouble",
            "description": "When our heroes are invited back to Darkly’s Boarding School, they discover it’s a trap set up by Lord Garmadon and his evil replica ninjas created by Garmadon’s new Mega-Weapo. Realizing how to correctly wield the Mega-Weapon, Lord Garmadon creates evil replicas of the Ninja to face off with our heroes. Meanwhile, Lloyd and the Ninja are invited back the Darkly’s Boarding School, only to discover it’s a trap and now the bad kids have seized control of the school. With the Ninja trapped in the school with the faculty, things spiral out of control as the Evil Replica Ninja arrive. As an awesome battle takes place in the school halls, the Ninja manage to outsmart their evil versions, and warn Lord Garmadon they’re ready for whatever else he throws at them.",
            "thumbnail": "https://image.tmdb.org/t/p/original/fCFwLPgYN0RhQk7xidZug9KaQvI.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/2d/f9/10369166/s10369166.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/1c/ad/7138169d6425664f3278944141474ec6.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "Ninjaball Run",
            "description": "When the ninja learn that Darreth’s Mojo Dojo is to be destroyed and Darreth doesn’t have the money to save it, our heroes enter the annual NinjaBall Run to win its cash prize in order to save the dojo. As Lloyd continues to train and unlock his hidden powers, the Ninja learn land developers are going to destroy Darreth’s Mojo Dojo unless Darreth can find the money to save it. The Ninja decide to enter their Ninja Tank into the annual NinjaBall Run cross-country rally to try to win its cash prize. Revisiting past characters who also enter the race, the high-speed derby will only grow more dangerous as Garmadon enters his Black Bounty, realizing this is the perfect chance to use his Mega-Weapon and rid the ninja. In the end, the Ninja will discover a few secrets within their Ninja Tank, allowing them to beat Garmadon’s Bounty by a millisecond and saving Darreth’s Dojo with their well-deserved cash prize.  And as a final surprise, the Ninja steal back the Destiny’s Bounty and make it their own once again.",
            "thumbnail": "https://image.tmdb.org/t/p/original/jzI6q0jQ0LObU5UbeW90v4EkcYJ.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/93/f7/10369167/s10369167.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/7c/d4/545a292a104e9bd562fda4983ceb3c96.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Child's Play",
            "description": "When the Ninja interrupt Lord Garmadon from using his Mega-Weapon to ‘turn back the clock’ and bring to life the fossils of a monster, the Ninja are accidentally hit and turned into kids and are now forced to enlist Lloyd’s help to battle the awakened monster. Tired of intense training, Lloyd yearns to play and enjoy his youth. The Ninja remind Lloyd that along with great power, comes great responsibility. When the Ninja interrupt Lord Garmadon from using his Mega-Weapon to ‘turn back the clock’ and bring to life the fossils of a monster, the Ninja are accidentally hit and soon discover they’ve been turned into kids! Seeking Lloyd’s help and relying on childhood antics, the five ninja kids must destroy the reawakened monster that’s hunting them in the city. In the end, Lloyd makes the difficult decision and sacrifices his youth in order to save them from the beast, turning forward the clock and turning Lloyd into a young man. Sensei Wu fears now that since Lloyd is young man, the final battle of good versus evil approaches sooner than he had ever expected.",
            "thumbnail": "https://image.tmdb.org/t/p/original/3lkUldonUmxodEV5t8C7A34z7Q5.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/8e/11/10369168/s10369168.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/8e/38/e2939f8aca382d2d4d764d35047a8e8f.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "Wrong Place, Wrong Time",
            "description": "When Garmadon travels back in time in order to undo the past and rid the Ninja from the future, the Ninja follow him and try to stop him by using the Golden Weapons from the past to clash against Garmadon’s Mega-Weapon. In his most villainous attempt at using the Mega-Weapon, Lord Garmadon creates a vortex through space and time to return to the moment Wu first arrives to recruit Kai to become a ninja (Episode 1, 2011) in order to rid the ninja from the future. The Ninja follow him back in time, only to make the mistake in saving Nya from the Skeletons. Suddenly, Past Kai doesn’t have a need to become a ninja, so our current day heroes must fix the past to save their futures. The stakes rise as Garmadon catches wind the Ninja have followed him back in time and plans a dangerous trap.  In a final battle, the ninja use the Golden Weapons from the past to clash against Garmadon’s Mega-Weapon, causing all of the legendary weapons to shoot off into the night sky. In the end, our heroes return back to the present and learn the Mega-Weapon has ceased to exist because it was destroyed in the past, leaving them all without their elemental powers.",
            "thumbnail": "https://image.tmdb.org/t/p/original/dtV5uJRrgmc5RD0KFvftfRFj4CP.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/d9/f7/10369169/s10369169.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/f0/ab/74dd25a7b67cbafbf524bd74a2be1c33.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "The Stone Army",
            "description": "The ninja face off with an exhibit of a Stone Samurai Warrior that the toxic venom from the Great Devourer has brought to life while Garmadon manages to find a fabled Dark Island that is said to hold dark powers. Lord Garmadon struggles controlling the Serpentine now that he is without the Mega-Weapon. His latest endeavor is to lead the snakes in search of a fabled Dark Island that ancient texts say holds dark powers. Unable to find the island, the furious Serpentine abandon Lord Garmadon out at sea. Meanwhile, Lloyd and the Ninja are called to the museum to find the toxic venom from the Great Devourer has seeped into the ground beneath the city, and it’s brought an exhibit of a Stone Samurai Warrior to life! Our heroes come across Misako, Lloyd’s long lost mother. She’s an archeologist in search of stopping the prophesized battle between Lloyd and his father. She had unearthed the Stone Warrior, and shares how it was once part of an indestructible army created by a dark spirit named The Overlord.  When the balance is altered and evil is let into Ninjago, it will allow the Overlord to return and bring darkness and destruction to the land. Unable to destroy the Terminator-like Stone Warrior, the Ninja cleverly trap it. In the end, Lord Garmadon awakens on a small island at sea and hears the voice of the banished Overlord, promising him his wildest dreams. Garmadon uses his four hands to activate a mechanism, raising a lost land from out of the sea, creating a Yin/Yang symbol with Ninjago. The ultimate battle between good and evil begins to unfold.",
            "thumbnail": "https://image.tmdb.org/t/p/original/mOiAx3wWJlbcWSymOyQbVYIMuLI.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/fd/f6/10369170/s10369170.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/55/58/412b8ccf708307ef3a2f5ef9174c1477.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "The Day Ninjago Stood Still",
            "description": "The ninja try to flee from the rest of the Stone Army that has been brought to life by the Devourer’s toxic venom - and things get a lot worse when Garmadon arrives with a ‘Helmet of Darkness’ and seizes control of the Stone Army. Scales finally takes leadership over the Serpentine and plans to burrow beneath Ninjago City to level it to the ground. But as they burrow, they run into a lost chamber holding the rest of the Stone Army. The Devourer’s toxic venom in the ground brings the Stone Army to life, sealing the Serpentine in their tomb, and returning the snakes back to where they were first found. On the Dark Island, the Overlord directs Lord Garmadon to a giant celestial clock. Garmadon removes a ‘Helmet of Darkness’, which will grant the wearer control over the Stone Army, and also activate the clock to tick down to when the final battle will begin. Back in Ninjago City, the indestructible Stone Army surfaces and attacks, and the Ninja know the only thing they can do is to save as many people as they can. They manage to barely escape with other townspeople, only for the Destiny’s Bounty’s engines to get damaged. In the end, Lord Garmadon arrives with the helmet, and seizes control of the Stone Army.",
            "thumbnail": "https://image.tmdb.org/t/p/original/9Mzu09tLENIh9MaiIZ6dQvZqu8g.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/83/ad/10369171/s10369171.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/6c/99/e359bd4dff79da07c3a72123bc657198.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "The Last Voyage",
            "description": "The Ninjas, Lloyd, Sensei Wu and Misako journey to the Dark Island to find a ‘Temple of Light’ that can restore the Ninjas’ elemental powers but are attacked by Starteeth (barnacle-like star fish) that start eating through their ship. The Stone Army and Lord Garmadon have disappeared, and our heroes can see the mysterious Dark Island off their coastline. Fearing Garmadon is up to no good, Sensei Wu has the whole team suit up to begin a journey to the Dark Island. Since the Bounty’s engines are damaged, they plan to go by sea. Misako reveals her ancient scrolls state of a ‘Temple of Light’ that could return the Ninja’s elemental powers, and it could be found on the island. Meanwhile, Lord Garmadon has the Army mining for more ‘Dark Matter’, using it to build a Super-Weapon that will recreate Ninjago in a twisted evil way. When a storm hits at sea, our heroes are attacked by Starteeth (barnacle-like starfish that can eat through a ship) and are forced to find refuge on a lighthouse at sea. Inside, Zane discovers his inventor father, the Tinkerer, is alive!  Together, they repair the Bounty so it can fly again, escaping a giant Leviathan, and soaring to the Dark Island ahead.",
            "thumbnail": "https://image.tmdb.org/t/p/original/k6cKmjCvGsCYGpiifdOY6Cveptf.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/e0/f7/10369172/s10369172.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/ec/5f/9606ff4f5f96271617de4c8883ec69ea.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "Island of Darkness",
            "description": "After battling off Garmadon’s Stone Army, the Ninjas finally arrive at the Temple of Light where they harness their pure elemental powers, concentrating them onto Lloyd who becomes more powerful than he ever imagined. The Ninja camouflage the Bounty, creating a secret rebel base on the island. Misako says they must find the Temple of Light, because only when their elemental powers return, will they be strong enough to defeat the indestructible Stone Army. The Ninja search the dark, exotic island and come across Garmadon’s compound, where they’re building the Super-Weapon. The Ninja discover the Temple of Light is hidden at the highest peak of the island, and the Tinkerer aids their trek in creating a Drill Dozer so they can travel underground unnoticed. A final chase and battle takes place at the Temple of Light, as the Ninja solve the puzzle and harness their pure elemental powers, concentrating them onto Lloyd, who also becomes more powerful then he ever imagined. Their new abilities can destroy the indestructible Stone Warriors. Although Lord Garmadon finds this to be a setback, the Overlord reassures him darkness will prevail, as we end on seeing the Celestial Clock ticking down closer to zero.",
            "thumbnail": "https://image.tmdb.org/t/p/original/wuz2VB8VImU7VufLkGcXjBfslRb.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/27/04/10369173/s10369173.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/9b/20/3925001e5ab0036aeb0ba9d2fd2eb06a.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 11,
            "title": "The Last Hope",
            "description": "When the Ninjas’ attempt to return Garmadon’s ‘Helmet of Darkness’ to its perch at the Celestial Clock in order to prevent the final battle between Lloyd and his father from beginning fails, a Super Weapon is created that can destroy all of Ninjago. With the Overlord and Garmadon nearing completion of the Super-Weapon, Misako tells the group she thinks there could be one last chance at preventing Lloyd’s final battle with his father. She believes if they can steal the helmet off Garmadon’s head and return it to it’s rightful perch on the Celestial Clock, it could stop the clock before it reaches zero, thus preventing the final battle from beginning. Dressed as Warriors, the Ninja escort their ‘captive’ Misako to Garmadon, and the heroes see glimpses of the Super-Weapon being built. In a thrilling escape, Misako cleverly steals Garmadon’s helmet, and they race to the Celestial Clock. Lloyd has a brief encounter with his father, and hesitates striking him. When they return the helmet to its rightful perch, they’re one second too late, allowing the clock to reach zero, and for it to focus a beam of concentrated light from the sky into the Super-Weapon. Nya is taken hostage, as the others fall off a cliff, barely surviving the fall. The Ninja have failed -- the final battle has begun.",
            "thumbnail": "https://image.tmdb.org/t/p/original/iapU6GKS7A07CKj6mBiTjA3SRoa.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/6a/1a/10369174/s10369174.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/0b/ec/486fd166e4395b374d11f0177701e568.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 12,
            "title": "Return of the Overlord",
            "description": "When Garmadon uses his new Super-Weapon to turn Jamakai Village evil, he unwittingly unsettles the balance, allowing the spirit of the Overlord to cross over and possesses his body. Lord Garmadon witnesses the Super-Weapon come to life, revealing it to be ‘Garma-Tron’, a giant moving cannon. His first test subject is Nya. Meanwhile, the heroes prepare for the final battle and sneak-attack Garmadon’s compound…only to find it empty. The Super-Weapon is moving towards the coastline, where the cannon’s range can reach Ninjago. On the way there, the Ninja must face off with Evil Nya, turned dark from the Super-Weapon. On the coastline, Lloyd battles his father atop Garma-Tron. The battle is fierce, but Lloyd fails at stopping his father from firing Garma-Tron, turning Jamanakai Village evil. Garmadon naively celebrates, not realizing he’s undone the balance, allowing the spirit of the Overlord to cross over and possess his body. And as the Overlord continues to get more powerful, a hideous metamorphosis is taking place. Lloyd must fight the Overlord, and just when it looks like good will prevail, Lloyd is injured and thrown to the ground. In the end, the villains escape through a portal to Ninjago, and our heroes are abandoned on the island with no way home. And with the Green Ninja injured, it looks like all is lost. Evil has won.",
            "thumbnail": "https://image.tmdb.org/t/p/original/kWNFBuIIADOOiilQTLTg5r0pn46.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ef/26/10369175/s10369175.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/ad/fd/5edcc30fcda530de162c016d96cd36bb.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 13,
            "title": "Rise of the Spinjitzu Master",
            "description": "A great darkness has fallen upon Ninjago as Garmadon’s Super-Weapon has turned it evil but Lloyd and the Ninjas discover that light is more powerful than dark - and the final and ultimate battle is on. With spirits down, Lloyd rises on his injured leg, not willing to give up. He empowers the group with the message: ‘Ninja Never Quit’. Zane’s Falcon lures them back to the Temple of Light and they discover the First Spinjitzu Master’s hidden Golden Mech. Ultra-Dragon also arrives, allowing them all a chance at getting off the island and stopping The Overlord. Upon returning to Ninjago, they find a great darkness has fallen upon the land. At the center of Ninjago City, a giant fortress is there with the Overlord having gone through his transformation, now appearing as a large, black dragon. The team helps Lloyd use his Golden Mech to battle the Dragon Overlord, but the Dragon Overlord is too powerful. Unwilling to give up, one by one the team each sacrifices themselves, shielding Lloyd and turning into evil versions of their heroic selves. Still, they manage to successfully usher the injured Lloyd through the Stone Army and to the peak of the Dark Fortress. When all is at its darkest, Lloyd realizes light is far more powerful than the dark. Lloyd powers up, turning golden and becoming an Ultimate Spinjitzu Master! He creates a Golden Dragon and the two winged beasts battle in an epic aerial fight.",
            "thumbnail": "https://image.tmdb.org/t/p/original/cYnQmwXtBx50N1NdefcykFV5Gn5.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/75/a9/10369176/s10369176.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/6c/9d/4fd543ba7bf8c5453761580bbb3b9c6c.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}