{
    "season": 3,
    "episodes": [{
            "number": 1,
            "title": "The Surge",
            "description": "After a time of peace, the Ninja are called back into action. The spirit of the defeated Overlord has infected the electric grid of Ninjago and is using all available technology to exact his revenge on Lloyd. Nowhere is safe but fortunately, the Ninja have been given the powerful Techno Blades. But the only problem is that they have no idea how to use them. Time has passed since the Ultimate Battle, and while the Golden Ninja continues to watch over Ninjago, the other Ninja have become complacent as schoolteachers. When a mysterious invitation from genius Cyrus Borg brings them to the futuristic New Ninjago City, trouble surges when a digital virus of the Overlord takes over technology. The Golden Ninja makes a heroic entrance, only to find out his Golden Power supercharges the enemy. Sensei Wu stays behind so that the Ninja can escape with the only thing that can save Ninjago’s future – Borg’s Techno Weapons.",
            "thumbnail": "https://image.tmdb.org/t/p/original/2qy0SIjUR86K82l4pQIoyk1dbR.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/c5/d3/10369177/s10369177.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/b0/1c/b1b918ac4b512fc2004d5c685d86538e.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "The Art of the Silent Fist",
            "description": "The Ninja go into hiding but an army of the Digtial Overlord’s evil robotic Nindroids are hunting them wherever they go. Their only chance is to learn the secrets of the Techno blades and use them to cut all power to save Ninjao from this technological menace. The Ninja hide out at a safe place void of technology – Sensei Garmadon’s Sanctuary. That night, Zane is visited by Borg’s female robo-assistant, Pixal. She warns them that the Digital Overlord is after Lloyd’s Golden Power in order to become flesh, but the Techno Blades can reboot the system and erase him for good. After a highly advanced army of Nindroids attacks the Sanctuary, Lloyd flees with his father into the wilderness of Ninjago, while the rest set off on a quest to turn off all power in Ninjago, so that they can erase the Digital Overlord once and for all.",
            "thumbnail": "https://image.tmdb.org/t/p/original/5QLHXcrqoT4h7XIGNfS350rYDOX.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/dc/c6/10369178/s10369178.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/24/51/cc894fb0959badd7f0b81087c1b60662.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "Blackout",
            "description": "The power is out in all of Ninjag, but the hard drive containing the Digital Overlord has disappeared. Some mysterious Stranger has stolen it and is now sending alternatively powered Nindroids to attack the Ninja and capture Lloyd. After destroying the Power Station, the Ninja have dealt a massive blow to the Nindroids, but find getting back to the city troublesome without power. At the Junk Yard, Zane gives half of his heart to revive Pixal to help give guidance in their greater mission. Meanwhile, a mysterious cloaked Interloper steals the hard drive containing the Digital Overlord and creates a new foe for the Ninja to fight… Tech Wu. On the other side of Ninjago, Lloyd is trained by his father to harness his Golden Power to unlock an even greater potential – the power of the First Spinjtzu Master.",
            "thumbnail": "https://image.tmdb.org/t/p/original/tRszaUdiC3vX8MTwgJTpzgQecqt.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/db/de/10369179/s10369179.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/ed/54/527c737a46181f998ae5ec87d75f5d35.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "The Curse of the Golden Master",
            "description": "The Stranger and the hard drive with the Digital Overlord are still missing. The ninjas’ search for them brings them deep underground where they are assisted by an old enemy. But the Stranger and his Nindroids are getting ever closer to capturing Lloyd. The Ninja return to a powerless New Ninjago City and visit the Serpentine Tombs in effort to solve who had taken the hard drive containing the Digital Overlord – only to discover the snakes have gone straight. They learn of Serpentine Lore that a Golden Master will conquer all of Ninjago. The Nindroids attack, but with the help from Scales and his Serpentine ilk, they fight off the enemy and discover the culprit they are after is none other than Pythor! But it’s too late… the Digital Overlord and his henchman have captured Lloyd in a plot to sap his Golden Power to finally become flesh.",
            "thumbnail": "https://image.tmdb.org/t/p/original/tUxxXkOnFgEf2Hicy6BdNykFyDo.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/e2/ee/10369180/s10369180.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/75/3c/84b31c28b192f19b9459bc30fb0e89c8.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Enter the Digiverse",
            "description": "Pythor the Anachondrai and his Nindroids have captured Lloyd and are draining his golden powers to bring the Overlord back into Ninjago. And the Ninja must use the Techno Blades in a daring rescue … inside the Overlord's corrupted hard drive. Unable to save Lloyd in time, the Ninja resort to drastic measures. With the help from Borg’s advanced technology, the Ninja get digitized with their Techno Blades into the Digiverse in order to battle the Digital Overlord on his own turf and erase evil for good. While the Ninja learn new capabilities and explore the fantasy of a ‘digital world’, their friends must protect them from Pythor and his army in the ‘real world’. In the climatic conclusion, the Ninja ‘reboot the system’ and save Sensei Wu and Lloyd, but the Digital Overlord has managed to become flesh in the nick of time, only to be in a weakened state.",
            "thumbnail": "https://image.tmdb.org/t/p/original/kt8rzY2Bc8yknUqspS7OXcuiIk7.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/82/79/10369181/s10369181.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/4a/2a/a8afd421c2d9f0607ffaf571e0c8bfec.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "Codename: Arcturus",
            "description": "Lloyd is free but Pythor and the Overlord are nowhere to be found. However the Ninja have a cryptic clue to their next plan - something called Codename: Arcturus. But what is it? Finding out won't be easy but it will ultimately take the Ninja to a place where they never ever thought they would go. Since evildoers will always seek his Golden Power, Lloyd selflessly shares his power with the others, endowing them each with elemental power and returning himself back to the Green Ninja. Meanwhile, time has passed and the Ninja use state-of-the-art technology to track down the remaining threat. When they uncover a secret mission only known to them as Codename: Arcturus, in a nod to the Bond series, they send Kai to track down a mysterious convoy in a superspy car… only to discover the Overlord has survived and has built a rocket in order to retrieve the Golden Weapons, which have been previously blasted off into space.",
            "thumbnail": "https://image.tmdb.org/t/p/original/ecEzQ533sQSaT8x3sXFICGvsxlI.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/bd/fd/10369182/s10369182.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/5e/b9/21058df509a60389924414ec7aded62f.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "The Void",
            "description": "The ninja will have to quickly adapt to space as they race the Nindroids to retrieve the Golden Weapons of Spinjitzu. But one thing is getting to space. Another is to get safely back home again. The Ninja stow away on the rocket Arcturus and quickly find themselves in way over their heads.  Meanwhile, the rest of the team works as Mission Control to help guide the Ninja through a gauntlet of obstacles. Once they crash land on the Comet, they follow the Nindroids to the crash site of the Golden Weapons and witness that any who touch it, are destroyed. To make matters worse, they also discover cute alien life isn’t as friendly as they might think. In the end, the Nindroids escape with the Golden Weapons, abandoning the Ninja on a desolate comet.",
            "thumbnail": "https://image.tmdb.org/t/p/original/qqatW6ZjHrrxWjsjeWL7bhelRpn.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/5b/8d/10369183/s10369183.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/a2/ea/5c02afd8f7acb7b591290edc6e9d7428.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "The Titanium Ninja",
            "description": "Back in Ninjago it is time for the final battle with the reborn, god-like Overlord. The stakes have never been greater and one ninja must make the ultimate sacrifice to try to stop his reign of destruction.The Ninja are lost in space, but once Sensei Garmadon guides them to have trust in each other, they combine their powers and create their own ride back to Ninjago. Meanwhile, the Overlord uses the Golden Weapons to make his armor as the Golden Master. With the power of the First Spinjitzu Master, he reigns supreme over New Ninjago City. The Ninja and friends face the all-powerful threat and give people hope, but even with the help of the Serpentine cavalry, their last chance to stop the Golden Master fails. In a dramatic conclusion, Zane must sacrifice all to secure everyone’s future. After a touching eulogy in honor of the fallen Ice Ninja… Pixal discovers Zane has survived as the ‘ghost in the machine’, and is rebuilt anew as Zane 2.0.",
            "thumbnail": "https://image.tmdb.org/t/p/original/8lIxSXh8nZ2gKnyzQ1YAJfLO0q6.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/96/09/10369184/s10369184.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/94/81/3eef22d7cb1978634bf28fbaead04dbb.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}