{
    "season": 8,
    "episodes": [{
            "number": 1,
            "title": "The Mask of Deception",
            "description": "When an unknown criminal syndicate threatens the Royal Family, the Ninja are called back into action and must protect the royal princess and a fabled artifact that may hold supernatural powers. The ninja find themselves scattered to the four corners of the kingdom. Cole and Jay are searching in vain for some sign of Master Wu. Nya fights injustice in the north, while Kai and Zane attempt to fend off an angry lava beast in the west. This leaves Lloyd alone in Ninjago City. He rushes to the scene of a heist at Borg Tower and finds himself up against a team of highly trained operatives led by the mysterious masked MISTER-E. Lloyd fails to prevent the heist and an ancient artifact, the MASK OF DECEPTION, is stolen. Lloyd apprehends one of the criminals but the others escape. Dismayed by his failure, Lloyd calls the ninjas back to Ninjago. The friends are reunited and hope for a little rest and relaxation. These hopes are dashed with the arrival MASTER HUTCHINS, a servant of the Royal Family of Ninjago, who has been sent by the EMPEROR to request their help. A new criminal gang, SONS OF GARMADON (SOG), is attempting to acquire three ancient masks called the ONI MASKS, which are rumored to possess supernatural powers.",
            "thumbnail": "https://image.tmdb.org/t/p/original/cPDs8YGOYMxouWEuvGYScwav8UK.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/4b/17/10369225/s10369225.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/8c/9f/264148ced8385faa843bfcc2a462ebe7.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "The Jade Princess",
            "description": "In the wake of an assassination attempt targeting the royal family, the ninja invite the royal princess, HARUMI, into their makeshift family. Lloyd glimpses someone escaping over the rooftops with a sack on their back. Fearing it is the kidnapped princess, Lloyd takes up the chase! He discovers to his surprise, however, that the masked intruder is none other than the princess herself, who is not quite as docile or meek as she pretends. She has a habit of sneaking out of her chambers at night to feed the homeless who surround the Imperial Palace. This revelation only endears her to Lloyd more and Harumi and Lloyd quickly strike up a friendship. Unfortunately, trouble catches up to the ninja when the Sons Of Garmadon target the second Oni mask and attack the palace. The scope of the attack proves more than the Ninja were prepared for as the Sons of Garmadon detonate a series of subterranean bombs, bringing down part of the palace. Lloyd and Harumi escape onto the flying ship, DESTINY’S BOUNTY. But the victory is a pyrrhic one. The second Oni Mask has been stolen and Harumi’s parents and Master Hutchins are feared lost.",
            "thumbnail": "https://image.tmdb.org/t/p/original/zfKD9RUEHbX1cGqC2b4oECot8ZM.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/78/ee/10369226/s10369226.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/66/ff/f4ebb89aa682477217498b7e61b0764a.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "The Oni and the Dragon",
            "description": "While Princess Harumi learns to adjust to the life of a Ninja, Lloyd and Jay search for answers about the Oni Masks at Mystake's Tea house, while Cole and Zane attempt to infiltrate the Sons of Garmadon biker gang. Remembering that Lloyd managed to arrest one of the gang members at Borg Tower, the Ninja decide to interrogate him to ascertain the location of the third Oni Mask. In order to get him to talk, however, Cole suggests they visit MYSTAKE'S TEA HOUSE to obtain some \"truth tea.\" The truth-tea backfires spectacularly when Cole accidentally switches cups and drinks the tea himself. Zane is able to salvage the situation, however, and obtains a lead. He learns that the Sons of Garmadon frequent a karaoke bar called LAUGHY’S. Zane and Cole don disguises to infiltrate the bar. Cole assumes the alter ego “Rocky Dangerbuff,\" while Zane adopts the subtler moniker \"Snake Jaguar.\" In order to earn the gang's trust, Cole performs a karaoke routine that is a smash success. Unfortunately, during the routine, his disguise comes loose and he is exposed as a ninja. The Sons of Garmadon attack him, and Zane (who is still in disguise) is unable to intervene. Cole is taken prisoner while Zane is invited back to the Sons of Garmadon's secret base.",
            "thumbnail": "https://image.tmdb.org/t/p/original/g1JtbYU6KgiVgWzqD8tJomKTD8Y.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/3d/84/10369227/s10369227.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/c7/f6/26e8ad571dbb3b6bafc5779ce4bfe2c5.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "Snake Jaguar",
            "description": "Zane infiltrates the Sons of Garmadon and is forced to enter a deadly initiation race, while Cole, who is imprisoned by them, discovers that the gang have found the “key to the third Oni Mask,” and attempts to steal it. Zane is brought back to the Sons of Garmadon’s secret base where he meets KILO, an enormous biker whom Zane initially assumes to be the gang’s leader. Unfortunately, he is mistaken and learns the true leader is a mysterious unseen villain known only as THE QUIET ONE. Lloyd and the other Ninja discover that the Oni masks possess the ability to bring back the dead.  Lloyd learns that the Sons of Garmadon intend to resurrect his father…Lord Garmadon! Cole finds himself imprisoned in a dank cell. He overhears the cell guards talking and learns that the SOG have discovered “the key to the third mask.” Cole breaks out of his cell and goes looking for “the key,” only to find that the key is actually a baby. Cole escapes taking the baby with him. Elsewhere, Zane is subjected to a harrowing initiation ritual and must survive a motorcycle gauntlet through a rocky mountain pass. Zane’s luck takes a disastrous turn when the Quiet One informs the Sons of Garmadon that “Snake Jaguar” is actually the ninja Zane. In the middle of the race, Zane is attacked by SOG BIKERS and finds himself in a showdown with Mister-E, who reveals his true identity. He is actually ECHO ZANE, an earlier nindroid model built by the same creator who built Zane.",
            "thumbnail": "https://image.tmdb.org/t/p/original/dr4ifu6gSpiHe2kRUjgPTisLkmF.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/eb/84/10369228/s10369228.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/39/6c/5c1d712766bafbc43dd39a32ccf35668.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Dead Man's Squall",
            "description": "Zane’s near destruction at the hands of Mister-E forces the ninja to flee aboard the Bounty, where they discover a transmission Zane intercepted may reveal the secret identity of the Quiet One. Zane and Echo-Zane (AKA MISTER-E) square off for an epic battle. Unfortunately, the revelation of Mister-E’s true identity is a handicap that costs Zane dearly. He is badly beaten and left battered and broken at the bottom of a mountain ravine. Fortunately, Zane is able to activate a fail-safe beacon and the other ninja race to his rescue and bring him aboard the Bounty. This disastrous downturn marks the middle of the season. The ninja find themselves lost and directionless. While the ninja try to regroup aboard the Bounty, Pixal (the ninja’s AI system) informs them that Zane, in his final moments of consciousness, intercepted a communication between Mister E and The Quiet One. Pixal hopes to trace the call to its origin to determine the identity of the Quiet One. Meanwhile, Cole bonds with the baby and discovers a map tucked into the baby’s diaper, which reveals the location of the third Oni Mask. The ninja set a course for the mask, which is hidden in an uncharted jungle called “Primeval’s Eye.” Just as things seem to be looking up for the ninja, however, the ship begins to founder. The ninja rush to the control room where they discover someone has uploaded a virus into Pixal’s database, affecting her ability to pilot. This also leads to a discover that Pixal has been moonlighting as Samurai X. Unfortunately, with the virus affecting her system, Samurai X turns against her and attacks the Bounty. The ninja must contend with the elements and a dangerous ally-turned-foe as Samurai X destroys the Bounty’s thrusters, causing the ship to plunge into the wilderness of Primeval’s Eye.",
            "thumbnail": "https://image.tmdb.org/t/p/original/fahGgqzhM6QQ9KBwbzASpxAlwjl.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/eb/9e/10369229/s10369229.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/f5/ed/9f9a933686fd6745be6dcd7df813a196.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "The Quiet One",
            "description": "As Lloyd and Harumi venture deep into ‘Primeval’s Eye’ in search of the third Oni Mask, the Ninja attempt to fix the Bounty and make a startling discovery. During the crash, the ninja are separated. Harumi and Lloyd crash into one part of the jungle, while the remaining ninja, aboard the Bounty, crash several miles away. As the Sons of Garmadon close in on them, a desperate three-way race for the third Oni mask ensues. Aboard the Bounty, the ninja make an unexpected discovery. The baby that Cole rescued is ageing more rapidly than normal and has become a toddler. On top of that, the toddler can speak and mumbles the words, “ninja… never… quit!” which leads the group to realize the baby is MASTER WU! Several miles away, Lloyd and Princess Harumi fight their way through the jungle and discover an abandoned pontoon boat. Using the boat, they make their way downriver and accidentally disturb a centuries old CRUSTACEAN who attacks them.  They manage to evade the crustacean to finally reach the Oni Temple, and the resting place of the third mask. Meanwhile, back at the Bounty, the ninja restore power to the thrusters and the trace program Pixal was running comes alive.The origin of the Quiet One’s transmission is revealed: It came from the Bounty! The ninja make a shocking discovery… the Quiet One is Harumi! They race to warn Lloyd. Unfortunately, as they attempt to take off, the Sons of Garmadon arrive. Using the baby Wu as a hostage, they seize control of the ship.",
            "thumbnail": "https://image.tmdb.org/t/p/original/ueiC1pu6hSLWO3Cx81NTHB6dXZy.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/a6/eb/10369230/s10369230.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/25/36/b9d41f0ba07fb5cdadf15cc619aa5ca4.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "Game of Masks",
            "description": "As Lloyd and Harumi search the Oni Temple for the last mask, the Ninja are taken hostage and discover Princess Harumi’s true intentions. The discovery of the Quiet One’s true identity leads to a FLASHBACK that reveals a pivotal moment in Harumi’s childhood and the reason for her hatred of the ninja. In a tragic moment, her biological parents are killed in an attack by the Great Devourer -- a loss for which she blames the ninja. In the present, Lloyd and Harumi make their way deeper and deeper into the Oni Temple. Lloyd uses his cunning to bypass a number of booby-traps and they arrive at the inner-most sanctum where the THIRD ONI MASK waits. With the mask in sight, Harumi finally reveals herself as the Quiet One. Lloyd is devastated. In the ensuing confrontation, Harumi defeats him, steals the mask and leaves Lloyd to drown in a flooding chamber. Outside, the Sons of Garmadon arrive in the commandeered Bounty, and await their master. Harumi emerges just as the Ninja attempt to regain control of their ship. Lloyd, having found a way out of the flooding temple, joins the fight and for a moment or two, the tide of battle seems to shift in their favor. But, in a surprise twist, the enormous crustacean from the previous episode attacks the Bounty and throws everything into turmoil.",
            "thumbnail": "https://image.tmdb.org/t/p/original/kPzvqhvkpfau9CogWHVJRS2qF8D.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/41/f7/10369231/s10369231.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/2a/8e/dddd9aa8df43434398605b63b9d78fad.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "Dread on Arrival",
            "description": "In a race against time, the Ninja must save Lloyd and thwart Harumi’s ceremony to resurrect Lord Garmadon. Lloyd awakens to find himself Harumi’s prisoner. He is transported back to the ruined Imperial palace where Harumi intends to fulfill her sinister plan and use the Oni masks to resurrect Lord Garmadon. Unbeknownst to Harumi, the ninja have managed to subjugate the enraged crustacean and ride the beast back to Ninjago City. They park the giant crab outside Ninjago’s Police Station and dash in to inform the COMMISSIONER of Harumi’s plan. The Commissioner rallies his men and joins the ninja in a last-ditch effort to prevent the resurrection. Meanwhile, Lloyd is led into the catacombs and arrives at a secret temple below the Imperial Palace. There he is startled to learn Harumi has procured a hostage -- Lloyd’s own mother, MISAKO! Outside, the commissioner arrives with his police force and attacks the imperial palace, providing a valuable distraction for the ninja, who slip unseen into the palace using Kai’s submersible speedboat to enter the gardens via a canal. Just as Harumi succeeds in opening an otherworldly portal to summon Garmadon, the ninja arrive.",
            "thumbnail": "https://image.tmdb.org/t/p/original/xjnx0KQztQ5hACr5B3d0yjYZP8j.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/aa/6d/10369232/s10369232.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/05/c3/2fe1aa8c7c53e78ea62b450cbd775cb3.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "True Potential",
            "description": "Just when the Ninja think they have saved the day, Lord Garmadon returns to Ninjago, and sets about freeing Harumi, who attempts to help Garmadon achieve his “true potential” by conquering the one thing that has always stood in his way… his own son, Lloyd. Thinking they have prevented the disastrous resurrection of Garmadon, the ninja enjoy a long overdue celebration at Laughy’s bar. All but Lloyd, who finds himself unable to celebrate in the aftermath of Harumi’s betrayal. The celebration is short-lived, however, when a newscast reveals an unknown assailant with four arms has broken Harumi out of Ninjago’s Central Jail! The ninja race to the scene and their worst fears are confirmed. The unknown assailant was none other than Garmadon, who next sets his sights on the towering walls of Kryptarian Prison where the Sons of Garmadon are imprisoned. As the ninja try to formulate a plan to restore order, Lloyd decides he must face his father and appeal to the good in him. The other ninja consider this plan reckless and remind him that the Oni ritual would have only brought back the evil part of his father. Lloyd seems to reluctantly accept their advice, but at the first opportunity, locks the ninja in the Bounty’s galley and races off to confront his father. He arrives at Kryptarian prison where the encounter goes disastrously. Harumi has convinced the newly resurrected Garmadon that in order to achieve his full potential, he must destroy the one obstacle that has always stood in his path: his own son.",
            "thumbnail": "https://image.tmdb.org/t/p/original/jyQzVd7x74DXPzOsstCgWzTenJP.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/64/00/10369233/s10369233.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/9a/f1/38098343c04e23186cf2d9476e0a8d42.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "Big Trouble, Little Ninjago",
            "description": "A more powerful-than-ever Lord Garmadon creates three enormous COLLOSSI to help him rule Ninjago and defeat the ninja.  The ninja retrieve Lloyd and rush him to Mistake’s Tea House, hoping for a magical tea that will help Lloyd recover from his injuries. Mistake tells them she has such a tea – but it comes with a price. It will heal Lloyd’s injuries but will cost him his elemental powers. Meanwhile, Garmadon’s powers grow and the evil Lord sets out to find his brother, Master Wu, whose presence he feels somewhere in Ninjago City. Harumi encourages Garmadon to demonstrate the scope of his power to all Ninjago. He uses his telekinetic abilities to conjure three enormous COLLOSSI (one made of sand, one made of stone, and one made of asphalt). Lloyd recovers from his injuries and takes the loss of his elemental powers with stoic grace. He has learned a valuable lesson about not heeding the advice of his friends. The ninja put their heads together and come up with a plan: Jay and Lloyd will fetch the Bounty while Cole, Zane and Kai head for Borg tower to ensure Wu and Misako’s safety. While the Colossi lay waste to the city, searching for Wu, the ninja arrive and attempt to rescue him from Borg Tower. In the final confrontation, Lloyd faces off against Harumi, while the ninja attempt to hold the enormous colossi at bay.",
            "thumbnail": "https://image.tmdb.org/t/p/original/wIIODP1R3v9cUoP02v06j7SHKOE.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/41/44/10369234/s10369234.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/7f/03/146a477e1723bcc26c9aa899926db8b9.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}