{
    "season": 6,
    "episodes": [{
            "number": 1,
            "title": "Infamous",
            "description": "After destroying the Cursed Realm and saving Ninjago, the Ninja have discovered newfound fame. But they must be careful what they wish for because a new evil named Nadakhan the Djinn is freed and a new age of piracy has begun.  After the defeat of the ghosts and the destruction of the Cursed Realm, the ninja find themselves famous all over NINJAGO. Commercials, action figures, public appearances – the ninja are the biggest thing ever. Tearing themselves away from their adoring public, they head to Stiix to investigate the possible return of the ghost of Clouse, Master Chen’s sorcerer. Meanwhile, Clouse has retrieved the legendary Teapot of Tyrahn and summoned Nadakhan the Djinn from inside it. Nadakhan tricks Clouse into taking his place in the teapot and then travels to NINJAGO City. There, he discovers that the woman he loved is long dead and his pirate crew has been scattered across the 16 realms. The only way he can retrieve them is to get the Realm Crystal from the ninja. After a fruitless search for Clouse, the ninja discover that someone has been posing as them and committing crimes in NINJAGO City. They are pursued by a mob and by the police and have to split up to avoid capture. Sensei Wu’s researches have led him to information on the Teapot of Tyrahn, just in time for Nadakhan to appear in the room with him! (Although it is not revealed in this episode, Wu winds up trapped in the Teapot.)",
            "thumbnail": "https://image.tmdb.org/t/p/original/peZPscli0iIIz2e9NfhNOIzhbww.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/d8/35/10369205/s10369205.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/d4/a6/efbb179618c0484a7886db3b966f224e.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "Public Enemy Number One",
            "description": "The Ninja must find out as much as they can about Nadakhan before he finds the Realm Crystal to save his crew, but after the Ninja are labeled enemies by the world they used to protect, our heroes find themselves hunted by their old friend, Ronan. With the Destiny’s Bounty impounded, the police hire Ronin to track down the fugitive ninja. Misako has been arrested and is confronted by Nadakhan, who reveals he has trapped Wu in the Teapot of Tyrahn. Misako accidentally reveals the location of the Realm Crystal. The ninja discover that Wu was researching djinn when he disappeared and split up to learn more about their potential new foe. Lloyd and Zane head to the Library of Domu. While there, Ronin hacks into Zane’s systems and shuts him down, then captures Lloyd. Ronin uses Zane’s SOS beacon to lure Kai and Nya into the desert, where they are captured. Later, Cole and Jay are defeated by Ronin as well. Meanwhile, Nadakhan has used his powers to foil the high-tech security guarding the Realm Crystal and steals it. The ninja are hauled off to Kryptarium Prison and Nadakhan is free to gather his lost crew.",
            "thumbnail": "https://image.tmdb.org/t/p/original/haK0MuNj3rE15HdzZbeNtgX6RR9.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/13/79/10369206/s10369206.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/e1/f1/e1ed2aa971a539ccccc2391ff3b0c1b5.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "Enkrypted",
            "description": "Falsely imprisoned, the Ninja are at their lowest point, but find an unlikely friend in an old enemy. Meanwhile, Nadakhan rescues his marooned crew and gains a new perspective, along with a new mysterious plan. With the ninja imprisoned, Nadakhan uses the Realm Crystal to free his old crew. The ninja encounter Captain Soto, the first captain of the Destiny’s Bounty, who tells them the story of how he originally trapped Nadakhan in the Teapot. The secret, he says, is the venom of a Tiger Widow, a rare creature that lives on only one island. The venom can slow a djinn down. Soto is the only one who knows where the island is and will only tell if the ninja break him out of jail. Meanwhile, Nadakhan has decided to return to his home realm of Djinjago, only to discover it is falling apart. The ninja’s destruction of the Cursed Realm is affecting the realms connected to it. Nadakhan uses the Djinn Blade to smash the Teapot, absorbing all the spirits that were trapped there into the sword. Nadakhan vows revenge on the ninja and NINJAGO. The ninja and Soto escape from jail, only to find out the map to the island is on Nadakhan’s ship. Nadakhan discovers that Nya looks just like Delara, his long-lost love.",
            "thumbnail": "https://image.tmdb.org/t/p/original/sWpyNjVLxVZekZ7q5e5TXjjHFrZ.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/c7/d7/10369207/s10369207.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/47/a9/a4ed567c2762f6ea5b38cc35cb713fc2.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "Misfortune Rising",
            "description": "The Ninja are on a collision course; to find the map to stop Nadakhan, they first must find him. Meanwhile, Jay makes a wish to change his future, but it could alter his past indefinitely.   The ninja’s search for Nadakhan’s ship turns up nothing. Nadakhan’s crew is struggling to handle an airship which used to sail only on the oceans. Nadakhan confronts Jay and talks him into making a wish that will win him Nya. Jay wishes that he wasn’t born in a junkyard and was rich. The next moment, he receives a letter saying his father has died and he has inherited his estate. Jay rushes home to find his parents in the junkyard and finds out they are fine, but they reveal that he is adopted. Jay discovers that his real father is the actor who played his favorite movie hero. In an effort to trap the ninja, the Sky Pirates start raids all over NINJAGO City. Nadakhan kidnaps Kai, who makes two wishes, both of which go wrong. His third wish is to “make it all go away.” Nadakhan’s first mate, Flintlocke, accidentally destroys the Realm Crystal and Cole steals Soto’s map. The Destiny’s Bounty mysteriously vanishes from the police impound yard.",
            "thumbnail": "https://image.tmdb.org/t/p/original/aylqvBOfiJj3v1i9D8tqRQlFQbD.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/d3/d3/10369208/s10369208.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/a0/90/17c7080b6de564eb621f4f30de9cd2e6.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "On a Wish and a Prayer",
            "description": "The Ninja set course to a dangerous island to find the only thing that can stop Nadakhan. Meanwhile, the Sky Pirates learn about the master plan, and a deep secret of the Ninja is exposed. Jay reveals to Cole that he made two wishes with Nadakhan. Large chunks of NINJAGO City are disappearing without a trace. The ninja find the Tiger Widow Island on the map but it is an island that exists on no other chart or database. Nadakhan reveals to his crew that he is stealing portions of NINJAGO to recreate Djinjago. The ninja use the late Cliff Gordon’s boat to head for the island. Zane’s falcon is captured by the pirates. Nadakhan confronts Zane, deletes Pixal, and traps Zane in his sword as a result of Zane’s wishes. The remaining ninja get to Tiger Widow Island and Jay goes to collect the spider’s venom. Nadakhan, Monkey Wretch, and Dogshank arrive to stop them. Jay gets the venom in a canteen, but Nadakhan spills it and kidnaps Jay. As the Sky Pirates escape, Nya reveals that she had switched canteens and the Tiger Widow venom is safe.",
            "thumbnail": "https://image.tmdb.org/t/p/original/yrNgEllHQtLkkhOHDHMX12Ca681.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ff/0d/10369209/s10369209.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/d5/10/3471e1568e76d49450774800b2a808e2.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "My Dinner with Nadakhan",
            "description": "Held captive on Misfortune's Keep, Jay is tested as Azad does everything in his power to break his will to say his final wish. Meanwhile, the marooned Ninja attempt to escape the island. Jay is trapped on Nadakhan’s ship, as Nadakhan tries to force him to make his third wish. Lloyd, Cole, and Nya are marooned on Tiger Widow Island. Jay learns that Nadakhan’s crew are almost all people who made wishes that did not work out the way they wanted them to, so they are all outcasts. Jay attempts to escape by jumping on the balloon of a raid zeppelin. He is caught, but not before he tosses a message in a bottle into the ocean. Nadakhan reveals that he intends to marry Nya, thus gaining the power of granting himself infinite wishes. Back on the island, the three ninja are attacked by sand eels. Jay is forced to fight the crew members one at a time for their amusement. Lloyd, Nya and Cole attempt to escape on a raft, but it takes damage from sand eels and is starting to sink. They are  rescued by Ronin, who arrives together with the police. The authorities now believe the ninja were framed for their crimes. Ronin has found Jay’s message in a bottle and is ready to help the ninja save their friend.",
            "thumbnail": "https://image.tmdb.org/t/p/original/oSQ7RY9Ph7IDpDlMU18ewNfkpRX.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/fb/9e/10369210/s10369210.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/c6/f1/4d93aab94469f793d3c2034f516bf764.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "Wishmasters",
            "description": "The last remaining Ninja dare to infiltrate the Sky Pirates in an attempt to save Jay and defeat Nadakhan once and for all.  The ninja are trying to figure out a way to save Jay from Nadakhan’s ship. Two screenwriters, Kevin and Dan, suggest that they build a fake raid zeppelin and disguise themselves as Sky Pirates. As construction begins, an acting coach teaches the ninja how to talk like pirates. The ninja infiltrate the ship and Cole goes to slip the venom into Nadakhan’s drink. But he stumbles on Jay, helps him escape, and forgets to use the venom. The two of them, plus Nya and Lloyd, wind up captured by the pirates. Nadakhan is going to make the ninja walk the plank until Nya agrees to marry him. But Cole foils him by wishing that the material used to make their chains would make the ninja more powerful. For a while, it looks like the ninja might win out until Cole wishes they were “all out of here” – and the pirates’ airship starts to tilt dangerously. Lloyd wishes to be wise like Sensei Wu and starts to age rapidly. Everyone falls off, but Nya wishes for the clouds to save them. They land on the now substantial cloud and the battle resumes. Nya and Jay fall off but combine their powers to create a hydro-electric dragon. Nadakhan captures Lloyd and Cole in his sword and orders Flintlocke to recapture Nya, but she and Jay escape.",
            "thumbnail": "https://image.tmdb.org/t/p/original/ljbboYytaQ5BqOKWfWC6ScuSCBW.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/6f/cc/10369211/s10369211.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/a3/e2/dc8bf9bcbe0c3266a901bf5907b9bcd7.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "The Last Resort",
            "description": "When the last two remaining Ninja are safe-guarded in a place no one would dare to look, the Sky Pirates discover their whereabouts and attack in search of the one who holds the power to unlock Azad's full potential. Jay and Nya have been holed up at the police precinct, but the Sky Pirates track him down. They flee by boat to the lighthouse where Zane’s father was once held captive. Nadakhan learns that the ninja still have the Tiger Widow venom. Flintlocke leads a mutiny against Nadakhan, convinced that the djinn will abandon his crew once he has the power of infinite wishes. Nadakhan defeats Flintlocke. Nya and Jay discover a hidden basement in the lighthouse. They discover “Echo Zane,” a rudimentary version of their friend made of copper and bits and pieces from the island. Nadakhan forces Clancee to use one of his wishes to discover where Nya is hiding. Jay and Nya rig up booby traps and defenses all over the island. The pirates attack in force. Jay and Nya fight bravely, but the tide turns against them. They briefly escape and Nya uses Traveler’s Tea to get Jay to safety. Nya is captured by the pirates.",
            "thumbnail": "https://image.tmdb.org/t/p/original/i5czkgqFnPpbKYJSZ3sSLLXKJyw.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/8c/45/10369212/s10369212.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/de/dd/3222754c70d2d1fe46febb26981ea30f.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "Operation Land Ho!",
            "description": "The last remaining ninja gets help from old allies to help him stop Nadakhan's ceremonial wedding from taking place. Jay lands back in the junkyard owned by his adoptive parents. Meanwhile, the pirates are getting Nya ready for her wedding rehearsal in the Djinn Temple. Dogshank discovers that Nya was concealing a blowpipe with a dart coated in Tiger Widow venom and orders Clancee to get rid of it. Jay recruits Dareth, Captain Soto, Skylar, Ronin, Echo Zane, and the Commissioner into a new team. Jay and the team hitch a ride on the next piece of land stolen by Nadakhan to get up to the djinn’s ship. Jay gets his hands on the Djinn Blade and voluntarily goes into it in search of his friends. Jay succeeds in freeing the ninja, Sensei Wu, and Misako.",
            "thumbnail": "https://image.tmdb.org/t/p/original/jU2QT32KczqUAGjgTEVgt29biHJ.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/be/f2/10369213/s10369213.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/3a/95/9f86888d9fd1b7d8970a798c9da25254.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "The Way Back",
            "description": "When Nadakhan acquires infinite wishes, Jay only has one. The restored ninja rush to save Nya, but they are too late: the wedding to Nadakhan happens. Nadakhan now has unlimited wishes and no rules governing them. He is too powerful for the ninja. Clancee betrays Nadakhan and tells the ninja where the dart with the venom is. Angered, Nadakhan banishes Clancee, Doubloon, and Monkey Wretch with a wish. Dogshank and Flintlocke team up with the ninja to battle magical duplicates of Nadakhan. Meanwhile, the djinn casts a spell to restore Delara’s spirit in Nya’s body. The ninja take over Misfortune’s Keep and ram it into the Djinn Temple. During the battle, Flintlocke shoots Nadakhan with the dart, and the djinn’s magic spells start to reverse themselves. But some of the poison gets on Nya, who is dying. Forced to use his last wish, Jay wishes that Nya had taken his hand long ago when he offered it … and that no one had ever found the Teapot of Tyrahn. The ninja find themselves back in NINJAGO City at the start of this adventure, with Jay and Nya now a couple. The teapot winds up on a trash barge with a load of other garbage, and this time Clouse does not find it. The barge sails off to dump both garbage and teapot at the bottom of the ocean.",
            "thumbnail": "https://image.tmdb.org/t/p/original/3eZu2iRWYyzZCCuQkVwwe2PG4FJ.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/76/e8/10369214/s10369214.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/8d/74/eec33c0f539147429ea78754e86228f0.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}