{
    "season": 4,
    "episodes": [{
            "number": 1,
            "title": "The Invitation",
            "description": "When the Ninja receive an invitation to partake in the Tournament of Elements and a clue that Zane might be alive, they accept and travel to a Lost Island owned by notorious crime lord Master Chen in order to save their friend. The loss of Zane has fractured the team of Ninja, but when a mysterious invitation to Master Chen’s ‘Tournament of Elements’ arrives, everything is thrown into question – Is Zane alive, and are there others out there with powers like them? Sensei Garmadon warns them not to trust Master Chen, but they go in order to find Zane and make the team whole. On route to the island, the Ninja are briefly introduced to the other unique fighters with elemental powers, and the mysterious and beautiful Skylor intrigues Kai. Kai gets into a humbling scrap with Karlof, the Master of Metal, and learns some fights must be done on your own.",
            "thumbnail": "https://image.tmdb.org/t/p/original/tYQJupG6699qOek5InWhcB4MTff.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/74/5f/10369185/s10369185.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/c7/43/a50434bbc1af8e9c0cb143a7d4bdc9df.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "Only One Can Remain",
            "description": "On the island, Lloyd learns that his father used to train under the deceitful Master Chen and when the Ninja meet the playfully deceitful ruler, they realize they are in a tournament where “Only one can remain.” On the island, Lloyd learns his father used to train under the deceitful Master Chen. They meet the playfully deceitful ruler who tells them they are in a tournament where ‘Only one can remain’. When they are spoiled by their posh quarters, they are surprised to find the game is already afoot: Last person to find a Jade Blade is out. After an epic battle of elemental powers, Kai steals the last one from Karlof, who is kicked out of the tournament through a trap door leading to the unknown. Later that night, the Ninja go in search for Zane but come across an underground temple where Chen and his Anacondrai Worshippers steal Karlof’s power. Is this a fighting tournament, or a ploy to steal everyone’s power?",
            "thumbnail": "https://image.tmdb.org/t/p/original/tUCgEqFGoYIgcadu62rklI9N1sK.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/cf/f2/10369186/s10369186.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/c5/60/d3df624ab10f1224d0d3c463da2a1940.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "Versus",
            "description": "In order find Zane, the Ninja stay in the tournament to get past the first round but Chen complicates things by changing the bracket and pitting Jay against Cole. In order to find Zane and get to the bottom of Chen’s mysterious plot the Ninja need to stay in the tournament and get past the first round. Chen complicates things by changing the bracket and pitting Jay against Cole. Meanwhile, new Titanium Ninja Zane is locked in a dungeon and has a nightmare about a ferocious Ice Dragon. Guided by the voice of Pixal, he embraces his new technology and escapes his cell, only to find Pixal hasn’t fared as well. Though she has no body, he inputs her CPU into his, uniting the two. In an attempt to prevent Jay versus Cole, the Ninja enlist the Master of Mind to help, but are unable to prevent the inevitable. In a gladiator battle, Jay and Cole put aside their feud to throw the match --enraging Chen to send Cole down the mysterious trap door. Lastly, Nya sees Zane’s beacon is working again and is on the hunt for them.",
            "thumbnail": "https://image.tmdb.org/t/p/original/17XeMtmwekcirgabdhBUNtvzmRq.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/15/ac/10369187/s10369187.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/4e/2c/159a3aaf6219afe959ec0b72fe0b1e82.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "Ninja Roll",
            "description": "Chen pits everyone against each other in a ludicrous roller skating event called Thunderblade  and all contestants team up against the Ninja; so the Ninja share inside information on Chen to get help from a new alliance in order for Lloyd to move on in the tournament. After losing Cole, the Ninja are more fractured than ever, and everyone in the tournament is gunning for the favorite -- Lloyd. To make matters worse, Chen pits everyone against each other in a ludicrous roller skating event called Thunderblade, and all of the contestants team up against the Ninja. In order to make sure Lloyd moves on in the tournament, the Ninja share inside information on Chen and get help from a new alliance. Back in Ninjago, Nya discovers Noodle Trucks disappearing at night and trails them; but when Darreth nearly spoils her mission, she is forced to take him along. Lastly, Cole’s power is stolen and he must work in an underground Noodle Factory where there is no hope for escape... but he comes across Zane in his cell and makes a promise to free him.",
            "thumbnail": "https://image.tmdb.org/t/p/original/A4B6y1kLdBhdd1wjZRQsBz3JFat.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/83/a2/10369188/s10369188.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/8c/45/810b1c9afcfa6d4f4e8f37f6d5aa6365.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Spy For a Spy",
            "description": "The Ninja have a secret alliance of elemental fighters, Cole has found Zane and Nya is a spy within Chen’s Kabuki to figure out what nefarious plot Chen is up to - but Chen upends the alliance by promising the all powerful Staff of Elements to the victor, and reveals that he too has a spy in the tournament. Things are looking up - not only do the Ninja have a secret alliance of elemental fighters, but Cole has found Zane, and now Nya is a spy within Chen’s Kabuki to figure out what nefarious plot he is up to. But Chen regains control when he upends the alliance by promising the all powerful Staff of Elements to the victor, and reveals that he too has a spy in the tournament. The Ninja confront the alliance to find Chen’s spy – but tempers and powers flare causing Jay to get injured. Undercover Nya gets discovered by Chen, allowing the Thugs to capture Darreth and her Mobile Base. After she narrowly escapes, the audience discovers Skylor is the real spy. Lastly, Cole and Zane cleverly break-out, only to realize a true ninja wouldn’t just save themselves, but the rest of the factory workers.",
            "thumbnail": "https://image.tmdb.org/t/p/original/fTOhI2OEES9wRBhJG7gXGo786tu.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/0a/e6/10369189/s10369189.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/4c/20/7f124d5b50ec5981ce5d1925f84256be.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "Spellbound",
            "description": "Nya has proof of Chen’s plan but he entices the contestants to hunt her down with promises to advance the winner, forcing the Ninja in a race to get to her first – and Lloyd discovers Chen’s plan to steal everyone’s power so that he can complete a spell and turn his worshippers into Anacondrrai and bring the return of the Serpentine War. Nya has proof that will expose Chen’s nefarious plan, but he entices the contestants to hunt her down with promises to advance the winner, forcing the Ninja in a race to get to her first. While on the hunt, Lloyd learns about the all-powerful Anacondrai in the Serpentine War from his father, as well as Garmadon’s biggest regret. In a deceptive turn, Chen secretly uses the hunt to capture the remaining fighters one by one. Meanwhile, Zane has a nightmare about the Ice Dragon again, and is unable to face his fear. Cole has a good idea to free everyone from the factory, but Darreth’s arrival throws a wrench into his plans. As the contestants dwindle down on the hunt, Skylor betrays Kai and he finds out she is actually Chen’s daughter! In the end, Lloyd finds Nya and discovers Chen’s plan is to steal everyone’s power so that he can complete a spell and turn his worshippers into Anacondrai and bring the return of the Serpentine War.",
            "thumbnail": "https://image.tmdb.org/t/p/original/lfxypfPk4vrkMbmjUraF72tJtFo.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/d7/17/10369190/s10369190.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/e9/e1/67c846a7dc57fed23e1e8de8dfa7cfd9.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "The Forgotten Element",
            "description": "After stealing the remaining contestant’s powers, Chen only needs Lloyd’s power to complete the spell and knowing his daughter has feelings for Kai, Chen tries to enlist the Fire Ninja by promising to share secrets about his parents. All the while, Lloyd tries to rescue the Ninja, pitting him in a showdown with Chen. After stealing the remaining contestant’s powers, Chen only needs Lloyd’s power to complete the spell. Knowing his daughter has feelings for Kai, Chen tries to enlist the Fire Ninja by promising to share secrets about his parents. All the while, Lloyd tries to rescue the Ninja, pitting him in a showdown with Chen -- which inevitably gets himself, along with Nya and Garmadon, captured. Elsewhere on the island, Cole leads the united fighters in the Noodle Factory to create a Roto Jet to break out and save Nya and Garmadon from being snake food. In the end, Kai pretends to change allegiance in an effort to obtain the Staff of Elements and stop the final ceremony. Chen is thwarted and the fighters get their powers back... but Chen escapes with his daughter as a hostage.",
            "thumbnail": "https://image.tmdb.org/t/p/original/mCjsFJ1BeIbvVtPkcM8fl6tNnVP.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/14/ae/10369191/s10369191.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/43/78/a1b78977b2f4d09a5fb0408eaa23331f.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "The Day of the Dragon",
            "description": "Chen has failed to bring the return of the Serpentine War but Clouse reveals there’s another way – his daughter has the ability to absorb the power of every fighter she comes across, so she can complete the ceremony – and Skylor finally sees her father for who he truly is and manages to send an SOS to the Ninja. The Ninja have control of the island and are on the search for Chen and Skylor. Though Chen has failed, Clouse reveals there’s another way – his daughter has the ability to absorb the power of every fighter she comes across, so she can complete the ceremony. Skylor sees her father for who he truly is and manages to escape and send an SOS to the Ninja. In the race to save Skylor, Zane falls into a cave and faces the Ice Dragon one last time. After facing his fear, he absorbs the Ice Dragon, enabling him to unleash a ‘Dragon Power’ similar to Lloyd. Also, Garmadon crosses path with Clouse in a final battle, causing Clouse to get sucked into his own vortex, into ‘The Cursed Realm’. Kai manages to save Skylor, but they get captured and the spell ceremony is completed – turning all tattooed worshippers into Anacondrai... including Skylor and Garmadon! The united Fighters battle the re-birthed Anacondrai, but are no match for Chen’s empowered forces. Chen abandons them on the island on route to bring the Serpentine War back to Ninjago. Zane returns to the fighters and encourages them to find their own ‘Dragon Power’ to get off the island, setting up the final showdown.",
            "thumbnail": "https://image.tmdb.org/t/p/original/6Z8CLi1bbGvPFd7OwOyjx3r6pJR.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/78/da/10369192/s10369192.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/76/a1/97ded27ed038a575cf04058996343cc4.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "The Greatest Fear of All",
            "description": "The Ninja reunite with Wu and turn to the aid of a shrunken Pythor in order to figure out how to defeat the unstoppable Anacondrai – but before they can get answers, Pythor is abducted by the Anacondrai and Chen uses his essence to make his worshippers transformation into Anacondrai permanent. The Ninja and fighters arrive to Ninjago using their newfound Dragon Power, only to be surprised to find no sign of Chen and his snake army. Within an underground subway, “Chen-Acondrai” discovers their transformation is merely fleeting, and they need the essence from a true Anacondrai to make the spell permanent. Meanwhile, the Ninja reunite with Wu and turn to the aid of a shrunken Pythor in order to figure out how to defeat the unstoppable Anacondrai. Before they can get answers, Pythor is abducted by the Anacondrai and Chen uses his essence to make their transformation permanent. The Ninja detect twenty ominous Noodle Trucks leading to every city and village. The Ninja and elemental fighters split up to intercept each truck, only to discover the trucks are empty – once again Chen has cleverly divided up our heroes. With the heroes scattered and divided, Chen and his snake army invade Ninjago -- the New Serpentine War has begun.",
            "thumbnail": "https://image.tmdb.org/t/p/original/hOa6ZXgGBW5sxtMJp6Zn7ldXhZB.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/39/8e/10369193/s10369193.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/db/52/f0cf428dde7f87f02b5b79ab92f20d4f.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "The Corridor of Elders",
            "description": "The Ninja and fighters discover there’s a strategic location called The Corridor of Elders where they can make their last stand against Chen’s Anacondrai army... but even with the new Destiny Bounty, their forces still aren’t strong enough. Fortunately, Pythor escapes Chen’s clutches and discovers there is one spell in the Book of Magic that could stop the war, but at a serious cost. As Chen and his army start toppling city by city with ease, the Ninja and fighters regroup and discover there’s a strategic location called The Corridor of Elders where they can make their last stand against Chen’s Anacondrai army... but even with the new Destiny Bounty, their forces still aren’t strong enough. Fortunately, Pythor escapes Chen’s clutches and discovers there is one spell in the Book of Magic that could stop the war, but at a serious cost. In order to unleash the ghosts of ‘honorable Anacondrai’ from a dangerous Cursed Realm to vanquish Chen and his ‘fake Anacondrai’, Garmadon must banish himself to the Cursed Realm to take their place. In an emotional farewell, Garmadon sacrifices himself, completing the spell, and the Ghosts of the Anacondrai drag Chen and his Anacondrai worshippers back into the Cursed Realm. After seeing the people of Ninjago fighting alongside the good Serpentine, the Ghost Anacondrai proudly bow to the Ninja and help turn Pythor back to his normal size. After the Ninja have saved the day and reflect on the loss of Sensei Garmadon… A final tag shows a DARK SPIRIT has escaped the cursed realm, uttering the name “Moro”.",
            "thumbnail": "https://image.tmdb.org/t/p/original/pWJ2bPmuyzKGwzXrjEA8B3iQkOl.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/4c/79/10369194/s10369194.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/dd/37/0266bdba685fe8f3f3745da7e5be880c.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}