{
    "season": 5,
    "episodes": [{
            "number": 1,
            "title": "Winds of Change",
            "description": "Kai promises to watch over Lloyd when Lloyd fears the loss of his father will make the path ahead uncertain– but when Wu sends them out on an errand for his new Tea Farm, Lloyd goes on a solo mission... only to discover it’s a trap from a GHOST who’s escaped the Cursed Realm. After the Ninja save a small fishing village, Lloyd fears the loss of his father will make the path ahead uncertain; but Kai promises to watch over him. When Wu sends them out on an errand for his new Tea Farm, Lloyd goes on a solo mission... only it’s a trap from a GHOST who’s escaped the Cursed Realm. When the Ninja’s powers mysteriously disappear, they return to the Tea Farm and are attacked by Lloyd, who is possessed by the spirit of Moro, the Master of Wind! After a harrowing escape on the Bounty, Wu tells the Ninja they weren’t his first pupils!",
            "thumbnail": "https://image.tmdb.org/t/p/original/ifnOJNLa58qZIwTmL2IUIMpOROy.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/dd/79/10369195/s10369195.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/91/69/77dff912455116f71f02378c5d4c667e.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 2,
            "title": "Ghost Story",
            "description": "When Moro gives chase to the Bounty and steals Wu’s staff, Wu shares the story of Moro: the boy who wanted to be the Green Ninja – and the Ninja discover Wu’s staff contained 3 symbols that lead to the Tomb of the First Spinjitzu Master which holds a mysterious relic that could alter the course of Ninjago.  Moro gives chase to the Bounty and steals Wu’s staff, leaving them to crash. When the dust settles, Wu shares the story of Moro: the boy who wanted to be the Green Ninja. They discover Wu’s staff contained 3 symbols that lead to the Tomb of the First Spinjitzu Master which holds a mysterious relic that could alter the course of Ninjago. In order to save Lloyd and get their powers back, they set off to find the first clue – the scroll to the lost martial art of ‘Airjitzu’. On their way to get it, they have a run in with one of Moro’s ghost generals Wraythe, and discover water is the key to stopping them. Meanwhile, Nya discovers a family secret – her mother was a Water Ninja and with training, she could be one too.",
            "thumbnail": "https://image.tmdb.org/t/p/original/cYMhaBsMYH4JdVJqEoYDb1VvaHQ.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/1c/06/10369196/s10369196.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/d3/63/c534107d3bbef4a6ce3d450148986838.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 3,
            "title": "Stiix and Stones",
            "description": "The Ninja travel to the Village of Stiix to find the thief who stole the scroll of Airjitzu, but the self-serving Ronan isn’t keen to sell it cheaply so the Ninja must figure out a way to make money on the docks – and when they fail to make enough cash, the Ninja decide to steal it – but have a run in with Moro and Sowlarcha. The Ninja travel to the Village of Stiix to find the thief who stole the scroll of Airjitzu, but when the self-serving Ronan isn’t keen to sell it cheaply, the Ninja must figure out a way to make money on the docks. Meanwhile, reluctant to give up being Samurai X, Nya struggles to embrace being a Water Ninja, and Sensei Wu gives her a riddle to figure out. Back at Stiix, when the Ninja fail to make enough cash working the docks, the Ninja decide to steal it... but have a run in with Moro and Sowlarcha. After Moro gets away with the scroll, the Ninja are left dangling, but Ronan saves them at a price – for a piece of their share in the Tea Farm.",
            "thumbnail": "https://image.tmdb.org/t/p/original/60qES7GuuEPfMKQVPAC6SPFWprz.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/6b/de/10369197/s10369197.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/e2/03/a7b69a60ffc95f79377b4d15a214186c.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 4,
            "title": "The Temple on Haunted Hill",
            "description": "The Ninja hear of another way to learn Airjitzu - from the ghost of Sensei Yang at his haunted temple - but there’s a warning; if you are trapped in it by sunrise, you will become a ghost, too. Meanwhile, doubting she’s a Water Ninja, Nya quits her training to take Ronan to her Samurai X cave…but has a run in with Moro. Nya’s training gets interrupted when Ronan arrives at the tea farm to rudely make his imprint on the struggling business. Meanwhile, the Ninja hear of another way to learn Airjitzu – from the ghost of Sensei Yang at his haunted temple. But there’s a warning, if you are trapped in it by sunrise, you will become a ghost too. The Ninja stay the night and are nearly scared away, but they stay long enough to find Sensei Yang who imparts the wisdom – ‘As iron sharpens iron, sensei sharpens student’. Doubting she’s a Water Ninja, Nya quits her training to take Ronan to her Samurai X cave... but has a run in with Moro. They escape, but only because the desert mysteriously rains; could she really be the Water Ninja? The Ninja get the scroll of Airjitzu and race out before sunrise, but Cole doesn’t make it out in time and becomes a ghost.",
            "thumbnail": "https://image.tmdb.org/t/p/original/g6M03bko3JHB483ZImuDN5a3TTT.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/7c/bf/10369198/s10369198.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/c5/52/bce74e387eb49c26fb2771f30ebc479f.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 5,
            "title": "Peak-a-boo",
            "description": "‘The Sword of Sanctuary’ from Cloud Kingdom, which can only be reached from the top of the Wailing Alps. The Ninja go on the treacherous mission up the tallest peak in blizzard conditions using their mechs, but Cole struggles with his ghostly form. As the Ninja train to learn Airjitzu, Cole struggles to come to terms with being a ghost – but Nya uplifts him; she never thought she would be a Water Ninja. Now that they know Airjitzu, they get briefed about how the next stage to finding the tomb is to get ‘The Sword of Sanctuary’ from Cloud Kingdom, which can only be reached from the top of the Wailing Alps. The Ninja go on the treacherous mission up the tallest peak in blizzard conditions using their mechs, but Cole struggles with his ghostly form. The Ninja remind him that ‘brother sharpens brother’, and even though they have a scrap with Moro and his henchmen, the Ninja are able to reach the peak and get to the Cloud Kingdom first.",
            "thumbnail": "https://image.tmdb.org/t/p/original/m1dK9Kcip5mzTCcq5sSqjFM5tVy.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/2a/ce/10369199/s10369199.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/b2/aa/2c1728b025021ff0a3efc9d1577d94d3.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 6,
            "title": "Kingdom Come",
            "description": "In Cloud Kingdom, a realm where destinies are written, the Ninja must get the Sword of Sanctuary, a powerful relic that can see past the traps surrounding the tomb of the First Spinjitzu Master – but tensions are high as Moro’s escape from the Cursed Realm has put the future in chaos, and they won’t give the Sword to the Ninja unless the Master Writer meets them personally. The Ninja arrive in Cloud Kingdom to find out it’s a realm where destinies are written. There they must get the Sword of Sanctuary, a powerful relic that can see past the traps surrounding the tomb. But tensions are high because Moro’s escape from the Cursed Realm has put the future in chaos, and they won’t give it to the Ninja unless the Master Writer meets them personally. Meanwhile, Ronan gives Nya a tip, and she controls water for the first time. As the Ninja await the Master Writer, they discover it’s a trap set in motion with a deal Moro has made with the Master Writer to ensure their future, but they escape and are chased down the slopes of the Wailing Alps. The Ninja steal the magical sword from Moro’s clutches, and for the first time, gain the upper hand.",
            "thumbnail": "https://image.tmdb.org/t/p/original/vHvyhnvVUIvFJYs8pJl6o51PqMv.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/20/cc/10369200/s10369200.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/e8/7f/de537fc38f0cedcd3c08e2139b5539b9.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 7,
            "title": "The Crooked Path",
            "description": "The Ninja now have all the items they need to get to the tomb of the First Spinjitzu Master but before they can figure out the last riddle that leads to the location of the tomb, Ronan steals the sword to give to Moro in exchange for his soul, and the Ninja and Nya are unable to stop him. The Ninja have all the items they need to get to the tomb but one thing - the whereabouts of the tomb. Before they can figure out the last riddle, Ronan steals the sword to give to Moro in exchange for his soul, and the Ninja and Nya are unable to stop him. Ronan returns to Stiix to give Moro the sword, but the ghosts change the deal and want the Ninja gone. Ronan refuses, but it’s too late; Moro possesses Ronan to lure the Ninja to a deathtrap while he goes in search of the tomb. Fortunately, Ronan gives up his airship to save the Ninja and inputs the correct coordinates to find the tomb.",
            "thumbnail": "https://image.tmdb.org/t/p/original/q9PyvjhsjZHDl5zTqhaFhia76zj.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/a3/ec/10369201/s10369201.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/24/25/7304f10a2ad74c85a454efc00e9b58e9.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 8,
            "title": "Grave Danger",
            "description": "The Ninja use Ronan’s airship to travel to the tomb of the First Spinjitzu Master in an underwater cave under the ocean, only to find out Moro is already there – and the Ninja must traverse the temple traps without the aid of the Sword of Sanctuary in a desperate attempt to get to the tomb first. The Ninja use Ronan’s airship to travel to the tomb in an underwater cave under the ocean, only to find out Moro is already there. The Ninja must traverse the temple traps without the aid of the Sword of Sanctuary and manage to get through the first two by the skin of their teeth... but when they catch up to Moro in the Ice Labyrinth, they work together to thwart him and get to the tomb first. There, they find the remains of the First Spinjitzu Master and the Realm Crystal; but Moro arrives and offers Lloyd’s life in exchange for the crystal. The Ninja attempt to trick him, but a battle ensues. The Ninja are able to save Lloyd and get their powers back, but Moro gets the Realm Crystal and returns to the Cursed Realm. Now all the Ninja can do is prepare for the Preeminent’s arrival.",
            "thumbnail": "https://image.tmdb.org/t/p/original/dfYUn3p8dPNfe0zTavuW6IbTvB8.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/18/cd/10369202/s10369202.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/48/18/99faac54dfbdfc46c438a554c3755ce8.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 9,
            "title": "Curseworld, Part 1",
            "description": "When Moro uses the Realm Crystal to open a portal to the Cursed Realm, ghosts take over the town - but the Ninja, in disguise, manage to get Lloyd to the center of the town and Lloyd steals the crystal…only to discover it’s too late as the Preeminent arrives. The New Year celebration is upon Stiix and revelers are celebrating the end of the Season of Change. But Moro uses the Realm Crystal to open a portal to the Cursed Realm; soon, the Preeminent will arrive. Meanwhile, the Ninja return to the Tea Farm to come up with a plan and suit up with new vehicles. At Stiix, ghosts have taken over the town, but the Ninja are in disguise, trying to get Lloyd to the center of town to steal the crystal. Through a clever trick utilizing Nya’s new ‘water power’, and using their new vehicles, they manage to get Lloyd close, but Moro confronts him. Lloyd gets to the crystal... but it’s too late. The Preeminent arrives and Lloyd is pulled into the Cursed Realm. All is at its worst.",
            "thumbnail": "https://image.tmdb.org/t/p/original/kayhb8jAdSeoNvst4MvxEi4W7QN.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/ec/76/10369203/s10369203.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/f2/b7/87b10b50ce2a5c785cf38b93b87b378d.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        },
        {
            "number": 10,
            "title": "Curseworld, Part 2",
            "description": "As the ghosts converge around and mobilize the Preeminent into a hulking giant behemoth, the Ninja use Airjitzu to fight the mobile beast in an attempt to slow it down – while, at the same time, Lloyd faces off with Moro, battling over the Realm Crystal; a fight that takes them in and out of different realms.  The Ninja try to take on Moro, but he’s unstoppable with the Sword of Sanctuary... until Ronin valiantly returns with a surprise punch, separating Moro from his sword! The heroes free the captured people who would be consumed by the Preeminent and take them onto a steamship because the ghosts fear water. The ghosts converge around and mobilize the Preeminent into a hulking giant behemoth made up of pieces of Stiix. As the hulking giant moves toward the steamship, the Ninja use Airjitzu, and fight on and within the mobile beast... but they are unable to slow it down. At the same time, Lloyd faces off with Moro, battling over the Realm Crystal; a fight that takes them in and out of different realms. In Ninjago, Kai faces his own fear of water and orders their sinking steamship into deeper waters... luring the giant behemoth toward the ledge of an underwater crevasse. In an epic moment, Nya unlocks her true potential and delivers a devastating water blow – crippling the monster. And when Moro returns solo, beating Lloyd, his weight causes the behemoth to tip over and sink into the abyss! Sensei Wu offers a hand to a sinking Moro, who rejects it. When dawn arrives, Wu uses the crystal to allow Lloyd back home, and the Green Ninja says he saw in the Sword of Sanctuary what would happen earlier, so he cleverly allowed Moro to think he won their fight. The Ninja are united and celebrate as they receive a hero’s welcome.",
            "thumbnail": "https://image.tmdb.org/t/p/original/5ElPbHLpLcZSMz4v1cxv5wIHId4.jpg",
            "embed": "https://cdn1.futuretodayinc.com/files/a8wn4hw/vi/36/08/10369204/s10369204.m3u8",
            "subtitles": [{
                "url": "https://cdn1.futuretodayinc.com/files/a8wn4hw/cc/a2/66/168e9b9138d8cd0e6b5233fb8a98cbdf.vtt",
                "lang": "en",
                "label": "English",
                "default": true
            }]
        }
    ]
}